org/posts/doom-emacs.org
#+TITLE: Doom Emacs
#+DATE: 2026-06-26
#+TAGS: Emacs
#+DESCRIPTION: A comprehensive Doom Emacs guide from beginner to advanced.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* Introduction & Concepts
** What is Doom Emacs?
Doom Emacs is a configuration framework (a "distribution") for GNU Emacs that
preconfigures Emacs to behave like a modern, Vim-style editor. It ships with
sane defaults, fast startup, a module system, and tight integration of
=evil-mode= (Vim emulation).

** How is Doom different from vanilla Emacs?
Vanilla Emacs is a blank slate; you write all configuration yourself. Doom gives
you a curated, opinionated, performance-focused setup with a declarative module
system, a leader-key based keybinding scheme, and a CLI (=doom=) to manage it.

** How does Doom differ from Spacemacs?
Both are Vim-friendly distributions. Doom prioritizes startup speed and minimal,
explicit configuration; Spacemacs is heavier, more abstracted ("layers"), and
generally slower to start. Doom favors readable Emacs Lisp over heavy macros.

** Is Doom Emacs a fork of Emacs?
No. It is configuration layered on top of stock GNU Emacs. You still install
Emacs separately; Doom configures it.

** What are Doom's main design goals?
Speed (fast startup via lazy loading and native compilation), a clean module
system, good defaults, and discoverability through =which-key= and the leader key.

** What Emacs version does Doom require?
A recent stable Emacs (Emacs 27.1 minimum historically; current Doom targets
Emacs 28/29/30). Emacs 29+ with native compilation (=libgccjit=) is recommended.

** What is "native compilation" and why does it matter?
Native compilation (=gccjit=) compiles Emacs Lisp to native machine code,
significantly improving runtime performance. Emacs built =--with-native-compilation=
lets Doom and packages run faster after an initial compile.

* Installation & First Run
** What are the prerequisites for installing Doom?
Git, Emacs (28+ recommended), ripgrep (=rg=), and =fd= (find alternative). Optional
but recommended: a Nerd Font / patched font for icons, and language tools (LSP
servers, =shellcheck=, etc.).

** How do I install Doom Emacs?
Clone Doom into your Emacs config dir and run the installer:

#+begin_src sh
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.config/emacs
~/.config/emacs/bin/doom install
#+end_src

** Where does Doom live on disk?
Two locations: the Doom core/runtime in =~/.config/emacs= (or =~/.emacs.d=), and your
personal config in =~/.config/doom= (or =~/.doom.d=).

** On Windows, where does Doom install?
Typically =%USERPROFILE%\.config\emacs= for the core and =%USERPROFILE%\.doom.d= or =%USERPROFILE%\.config\doom= for your config.
Install Emacs (e.g. via the official Windows build or scoop), plus =git=, =ripgrep=, and =fd= on the PATH.

** What is the recommended way to run Emacs as a server?
Start the Emacs daemon (=emacs --daemon=) and connect with =emacsclient=. This makes new frames open near-instantly since Emacs is already loaded.

** How do I add Doom's bin directory to my PATH?
Add =~/.config/emacs/bin= (or =~/.emacs.d/bin=) to your shell PATH so you can call =doom= from anywhere.

** What does =doom install= do?
It clones/installs all packages for your enabled modules, generates environment files, compiles, and runs =doom sync= for the first time.

** What is =doom sync= and when must I run it?
=doom sync= reconciles your config (=init.el=, =packages.el=) with installed packages.
Run it whenever you edit =init.el= or =packages.el= (enable/disable modules or add packages).

** What does =doom doctor= do?
It diagnoses your installation: missing dependencies, broken fonts, misconfigured servers, byte-compile warnings. Run it first when something is wrong.

** What does =doom upgrade= do?
It pulls the latest Doom core, updates all packages to pinned versions, and syncs. It is the standard way to update Doom.

** How do I roll back a bad upgrade?
Use git in =~/.config/emacs= to checkout the previous commit, then run =doom sync=.
Doom pins package versions, so a checkout restores the prior known-good state.

* The doom CLI
** What are the most important =doom= CLI commands?
=doom sync=, =doom upgrade=, =doom doctor=, =doom install=, =doom build= (=doom sync -b=), =doom purge=, =doom env=, =doom compile=.

** What does =doom env= do?
It captures your shell environment into an env file that Emacs loads, so GUI Emacs
inherits your PATH and variables. Re-run after changing your shell environment.

** What does =doom purge= do?
It removes orphaned/unused packages and old build artifacts to reclaim disk space.

** What does =doom build= (or =doom sync -b=) do?
It byte-compiles (and native-compiles) installed packages, improving performance.

** How do I update only packages, not Doom core?
=doom upgrade= updates both; to update packages alone, edit pins in =packages.el= or
use =doom sync -u= (update) depending on Doom version. Generally =doom upgrade= is
the supported path.

** What does =doom sync -u= do?
The =-u= flag updates packages to their latest allowed versions during sync.

* Configuration Files
