public/posts/doom-emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs</title>
<meta name="description" content="A comprehensive Doom Emacs guide from beginner to advanced." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Doom Emacs</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org6e5238a" class="outline-2">
<h2 id="org6e5238a">Introduction &amp; Concepts</h2>
<div class="outline-text-2" id="text-org6e5238a">
</div>
<div id="outline-container-org3bfd6d2" class="outline-3">
<h3 id="org3bfd6d2">What is Doom Emacs?</h3>
<div class="outline-text-3" id="text-org3bfd6d2">
<p>
Doom Emacs is a configuration framework (a "distribution") for GNU Emacs that
preconfigures Emacs to behave like a modern, Vim-style editor. It ships with
sane defaults, fast startup, a module system, and tight integration of
<code>evil-mode</code> (Vim emulation).
</p>
</div>
</div>
<div id="outline-container-orgc493e43" class="outline-3">
<h3 id="orgc493e43">How is Doom different from vanilla Emacs?</h3>
<div class="outline-text-3" id="text-orgc493e43">
<p>
Vanilla Emacs is a blank slate; you write all configuration yourself. Doom gives
you a curated, opinionated, performance-focused setup with a declarative module
system, a leader-key based keybinding scheme, and a CLI (<code>doom</code>) to manage it.
</p>
</div>
</div>
<div id="outline-container-orgbf62fb8" class="outline-3">
<h3 id="orgbf62fb8">How does Doom differ from Spacemacs?</h3>
<div class="outline-text-3" id="text-orgbf62fb8">
<p>
Both are Vim-friendly distributions. Doom prioritizes startup speed and minimal,
explicit configuration; Spacemacs is heavier, more abstracted ("layers"), and
generally slower to start. Doom favors readable Emacs Lisp over heavy macros.
</p>
</div>
</div>
<div id="outline-container-orgedaab94" class="outline-3">
<h3 id="orgedaab94">Is Doom Emacs a fork of Emacs?</h3>
<div class="outline-text-3" id="text-orgedaab94">
<p>
No. It is configuration layered on top of stock GNU Emacs. You still install
Emacs separately; Doom configures it.
</p>
</div>
</div>
<div id="outline-container-orgb39250c" class="outline-3">
<h3 id="orgb39250c">What are Doom's main design goals?</h3>
<div class="outline-text-3" id="text-orgb39250c">
<p>
Speed (fast startup via lazy loading and native compilation), a clean module
system, good defaults, and discoverability through <code>which-key</code> and the leader key.
</p>
</div>
</div>
<div id="outline-container-org0286c1a" class="outline-3">
<h3 id="org0286c1a">What Emacs version does Doom require?</h3>
<div class="outline-text-3" id="text-org0286c1a">
<p>
A recent stable Emacs (Emacs 27.1 minimum historically; current Doom targets
Emacs 28/29/30). Emacs 29+ with native compilation (<code>libgccjit</code>) is recommended.
</p>
</div>
</div>
<div id="outline-container-org344555c" class="outline-3">
<h3 id="org344555c">What is "native compilation" and why does it matter?</h3>
<div class="outline-text-3" id="text-org344555c">
<p>
Native compilation (<code>gccjit</code>) compiles Emacs Lisp to native machine code,
significantly improving runtime performance. Emacs built <code>--with-native-compilation</code>
lets Doom and packages run faster after an initial compile.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd93539" class="outline-2">
<h2 id="orgcd93539">Installation &amp; First Run</h2>
<div class="outline-text-2" id="text-orgcd93539">
</div>
<div id="outline-container-org93c91f2" class="outline-3">
<h3 id="org93c91f2">What are the prerequisites for installing Doom?</h3>
<div class="outline-text-3" id="text-org93c91f2">
<p>
Git, Emacs (28+ recommended), ripgrep (<code>rg</code>), and <code>fd</code> (find alternative). Optional
but recommended: a Nerd Font / patched font for icons, and language tools (LSP
servers, <code>shellcheck</code>, etc.).
</p>
</div>
</div>
<div id="outline-container-org098b229" class="outline-3">
<h3 id="org098b229">How do I install Doom Emacs?</h3>
<div class="outline-text-3" id="text-org098b229">
<p>
Clone Doom into your Emacs config dir and run the installer:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.config/emacs
~/.config/emacs/bin/doom install
</pre>
</div>
</div>
</div>
<div id="outline-container-org18a667a" class="outline-3">
<h3 id="org18a667a">Where does Doom live on disk?</h3>
<div class="outline-text-3" id="text-org18a667a">
<p>
Two locations: the Doom core/runtime in <code>~/.config/emacs</code> (or <code>~/.emacs.d</code>), and your
personal config in <code>~/.config/doom</code> (or <code>~/.doom.d</code>).
</p>
</div>
</div>
<div id="outline-container-org3250fe8" class="outline-3">
<h3 id="org3250fe8">On Windows, where does Doom install?</h3>
<div class="outline-text-3" id="text-org3250fe8">
<p>
Typically <code>%USERPROFILE%\.config\emacs</code> for the core and <code>%USERPROFILE%\.doom.d</code> or <code>%USERPROFILE%\.config\doom</code> for your config.
Install Emacs (e.g. via the official Windows build or scoop), plus <code>git</code>, <code>ripgrep</code>, and <code>fd</code> on the PATH.
</p>
</div>
</div>
<div id="outline-container-org8b0fced" class="outline-3">
<h3 id="org8b0fced">What is the recommended way to run Emacs as a server?</h3>
<div class="outline-text-3" id="text-org8b0fced">
<p>
Start the Emacs daemon (<code>emacs --daemon</code>) and connect with <code>emacsclient</code>. This makes new frames open near-instantly since Emacs is already loaded.
</p>
</div>
</div>
<div id="outline-container-orgfa67245" class="outline-3">
<h3 id="orgfa67245">How do I add Doom's bin directory to my PATH?</h3>
<div class="outline-text-3" id="text-orgfa67245">
<p>
Add <code>~/.config/emacs/bin</code> (or <code>~/.emacs.d/bin</code>) to your shell PATH so you can call <code>doom</code> from anywhere.
</p>
</div>
</div>
<div id="outline-container-org9566e5c" class="outline-3">
<h3 id="org9566e5c">What does <code>doom install</code> do?</h3>
<div class="outline-text-3" id="text-org9566e5c">
<p>
It clones/installs all packages for your enabled modules, generates environment files, compiles, and runs <code>doom sync</code> for the first time.
</p>
</div>
</div>
<div id="outline-container-org3d6314f" class="outline-3">
<h3 id="org3d6314f">What is <code>doom sync</code> and when must I run it?</h3>
<div class="outline-text-3" id="text-org3d6314f">
<p>
<code>doom sync</code> reconciles your config (<code>init.el</code>, <code>packages.el</code>) with installed packages.
Run it whenever you edit <code>init.el</code> or <code>packages.el</code> (enable/disable modules or add packages).
</p>
</div>
</div>
<div id="outline-container-org9817640" class="outline-3">
<h3 id="org9817640">What does <code>doom doctor</code> do?</h3>
<div class="outline-text-3" id="text-org9817640">
<p>
It diagnoses your installation: missing dependencies, broken fonts, misconfigured servers, byte-compile warnings. Run it first when something is wrong.
</p>
</div>
</div>
<div id="outline-container-org491d79a" class="outline-3">
<h3 id="org491d79a">What does <code>doom upgrade</code> do?</h3>
<div class="outline-text-3" id="text-org491d79a">
<p>
It pulls the latest Doom core, updates all packages to pinned versions, and syncs. It is the standard way to update Doom.
</p>
</div>
</div>
<div id="outline-container-org7155c2a" class="outline-3">
<h3 id="org7155c2a">How do I roll back a bad upgrade?</h3>
<div class="outline-text-3" id="text-org7155c2a">
<p>
Use git in <code>~/.config/emacs</code> to checkout the previous commit, then run <code>doom sync</code>.
Doom pins package versions, so a checkout restores the prior known-good state.
</p>
</div>
</div>
</div>
<div id="outline-container-orgdb7f914" class="outline-2">
<h2 id="orgdb7f914">The doom CLI</h2>
<div class="outline-text-2" id="text-orgdb7f914">
</div>
<div id="outline-container-orgf331b0c" class="outline-3">
<h3 id="orgf331b0c">What are the most important <code>doom</code> CLI commands?</h3>
<div class="outline-text-3" id="text-orgf331b0c">
<p>
<code>doom sync</code>, <code>doom upgrade</code>, <code>doom doctor</code>, <code>doom install</code>, <code>doom build</code> (<code>doom sync -b</code>), <code>doom purge</code>, <code>doom env</code>, <code>doom compile</code>.
</p>
</div>
</div>
<div id="outline-container-org49e00ed" class="outline-3">
<h3 id="org49e00ed">What does <code>doom env</code> do?</h3>
<div class="outline-text-3" id="text-org49e00ed">
<p>
It captures your shell environment into an env file that Emacs loads, so GUI Emacs
inherits your PATH and variables. Re-run after changing your shell environment.
</p>
</div>
</div>
<div id="outline-container-orgb7b8db5" class="outline-3">
<h3 id="orgb7b8db5">What does <code>doom purge</code> do?</h3>
<div class="outline-text-3" id="text-orgb7b8db5">
<p>
It removes orphaned/unused packages and old build artifacts to reclaim disk space.
</p>
</div>
</div>
<div id="outline-container-orgdf34c24" class="outline-3">
<h3 id="orgdf34c24">What does <code>doom build</code> (or <code>doom sync -b</code>) do?</h3>
<div class="outline-text-3" id="text-orgdf34c24">
<p>
It byte-compiles (and native-compiles) installed packages, improving performance.
</p>
</div>
</div>
<div id="outline-container-org3a80888" class="outline-3">
<h3 id="org3a80888">How do I update only packages, not Doom core?</h3>
<div class="outline-text-3" id="text-org3a80888">
<p>
<code>doom upgrade</code> updates both; to update packages alone, edit pins in <code>packages.el</code> or
use <code>doom sync -u</code> (update) depending on Doom version. Generally <code>doom upgrade</code> is
the supported path.
</p>
</div>
</div>
<div id="outline-container-orgf3b9c04" class="outline-3">
<h3 id="orgf3b9c04">What does <code>doom sync -u</code> do?</h3>
<div class="outline-text-3" id="text-orgf3b9c04">
<p>
The <code>-u</code> flag updates packages to their latest allowed versions during sync.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbd43e0f" class="outline-2">
<h2 id="orgbd43e0f">Configuration Files</h2>
<div class="outline-text-2" id="text-orgbd43e0f">
</div>
