public/posts/doom-emacs.html
<div id="outline-container-orgde9b23a" class="outline-3">
<h3 id="orgde9b23a">What are the three main config files?</h3>
<div class="outline-text-3" id="text-orgde9b23a">
<p>
<code>init.el</code> (enable/disable modules), <code>packages.el</code> (declare extra/override packages), and <code>config.el</code> (your personal Emacs Lisp configuration).
</p>
</div>
</div>
<div id="outline-container-orge75b100" class="outline-3">
<h3 id="orge75b100">What goes in <code>init.el</code>?</h3>
<div class="outline-text-3" id="text-orge75b100">
<p>
The <code>doom!</code> block listing enabled modules and their flags. You toggle features here, not write logic. After editing, run <code>doom sync</code>.
</p>
</div>
</div>
<div id="outline-container-org679dc1b" class="outline-3">
<h3 id="org679dc1b">What goes in <code>config.el</code>?</h3>
<div class="outline-text-3" id="text-org679dc1b">
<p>
All your personal customization: settings, keybindings, package config, hooks, and Emacs Lisp. It is loaded at startup.
</p>
</div>
</div>
<div id="outline-container-org02c6960" class="outline-3">
<h3 id="org02c6960">What goes in <code>packages.el</code>?</h3>
<div class="outline-text-3" id="text-org02c6960">
<p>
Package declarations: <code>(package! foo)</code> to install extra packages, <code>(package! bar :disable t)</code> to disable, or pinning/recipe overrides. Run <code>doom sync</code> after edits.
</p>
</div>
</div>
<div id="outline-container-org61d6a01" class="outline-3">
<h3 id="org61d6a01">Where is the Doom config directory by default?</h3>
<div class="outline-text-3" id="text-org61d6a01">
<p>
<code>~/.config/doom</code> on XDG systems, or <code>~/.doom.d</code> (legacy). Doom checks both.
</p>
</div>
</div>
<div id="outline-container-orgf0fcd05" class="outline-3">
<h3 id="orgf0fcd05">How do I find my Doom directory programmatically?</h3>
<div class="outline-text-3" id="text-orgf0fcd05">
<p>
The variable <code>doom-user-dir</code> holds your private config path; <code>doom-emacs-dir</code> holds the core path.
</p>
</div>
</div>
<div id="outline-container-orge6ab3df" class="outline-3">
<h3 id="orge6ab3df">What is <code>custom.el</code> and should I use it?</h3>
<div class="outline-text-3" id="text-orge6ab3df">
<p>
Emacs writes <code>M-x customize</code> settings to a custom file. Doom isolates this; prefer
configuring in <code>config.el</code> with <code>setq=/=after!</code> over the Customize UI for reproducibility.
</p>
</div>
</div>
<div id="outline-container-org4ce77e4" class="outline-3">
<h3 id="org4ce77e4">How do I reload my config without restarting?</h3>
<div class="outline-text-3" id="text-org4ce77e4">
<p>
<code>SPC h r r</code> (<code>doom/reload</code>) reloads, but a full restart is more reliable after big changes.
For pure elisp edits, <code>M-x eval-buffer</code> or <code>SPC m e b</code> in <code>config.el</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org4a84ce5" class="outline-2">
<h2 id="org4a84ce5">The doom! Block &amp; Modules</h2>
<div class="outline-text-2" id="text-org4a84ce5">
</div>
<div id="outline-container-orgb73151d" class="outline-3">
<h3 id="orgb73151d">What is the module system?</h3>
<div class="outline-text-3" id="text-orgb73151d">
<p>
Doom groups functionality into modules organized as <code>:category module</code>, e.g.
<code>:lang python</code>, <code>:tools magit</code>, <code>:editor evil</code>. You enable them in the <code>doom!</code> block.
</p>
</div>
</div>
<div id="outline-container-org06798c1" class="outline-3">
<h3 id="org06798c1">How do I enable a module?</h3>
<div class="outline-text-3" id="text-org06798c1">
<p>
Uncomment or add it in <code>init.el</code>'s <code>doom!</code> block, then run <code>doom sync</code> and restart.
</p>
</div>
</div>
<div id="outline-container-org9925947" class="outline-3">
<h3 id="org9925947">What are module "flags"?</h3>
<div class="outline-text-3" id="text-org9925947">
<p>
Flags refine a module's behavior, written with <code>+</code>: e.g. <code>(python +lsp +pyright)</code> or
<code>(org +pretty +roam2)</code>. They toggle optional features within a module.
</p>
</div>
</div>
<div id="outline-container-org9ecb843" class="outline-3">
<h3 id="org9ecb843">What are the module categories?</h3>
<div class="outline-text-3" id="text-org9ecb843">
<p>
<code>:input :completion :ui :editor :emacs :term :checkers :tools :os :lang :email :app :config</code>.
</p>
</div>
</div>
<div id="outline-container-org7ea4f73" class="outline-3">
<h3 id="org7ea4f73">How do I discover available modules and flags?</h3>
<div class="outline-text-3" id="text-org7ea4f73">
<p>
Browse <code>~/.config/emacs/modules</code>, read <code>SPC h d m</code> (Doom module docs), or check the
Doom documentation. Each module has a README describing flags.
</p>
</div>
</div>
<div id="outline-container-org7cc14ad" class="outline-3">
<h3 id="org7cc14ad">What is the <code>:completion</code> category for?</h3>
<div class="outline-text-3" id="text-org7cc14ad">
<p>
Completion frameworks: e.g. <code>vertico</code> (minibuffer completion), <code>corfu</code> or <code>company</code>
(in-buffer completion), <code>helm=/=ivy</code> (older). Pick one minibuffer + one in-buffer.
</p>
</div>
</div>
<div id="outline-container-orge2e8fa1" class="outline-3">
<h3 id="orge2e8fa1">What does <code>(:editor evil +everywhere)</code> do?</h3>
<div class="outline-text-3" id="text-orge2e8fa1">
<p>
Enables Vim emulation (<code>evil-mode</code>); the <code>+everywhere</code> flag extends Vim keybindings
into more Emacs interfaces (dired, magit, etc.).
</p>
</div>
</div>
<div id="outline-container-orgb357d6b" class="outline-3">
<h3 id="orgb357d6b">What does the <code>:config default</code> module provide?</h3>
<div class="outline-text-3" id="text-orgb357d6b">
<p>
Doom's sensible default settings and keybindings; <code>(default +bindings +smartparens)</code>
adds the standard leader-key bindings and smartparens.
</p>
</div>
</div>
<div id="outline-container-orgb2d6f14" class="outline-3">
<h3 id="orgb2d6f14">How do I disable a feature I don't want?</h3>
<div class="outline-text-3" id="text-orgb2d6f14">
<p>
Remove its module/flag from <code>init.el</code> and <code>doom sync</code>, or in <code>packages.el</code> add <code>(package! x :disable t)</code>.
</p>
</div>
</div>
<div id="outline-container-org1c30d9a" class="outline-3">
<h3 id="org1c30d9a">What happens if two completion modules conflict?</h3>
<div class="outline-text-3" id="text-org1c30d9a">
<p>
Doom will warn (run <code>doom doctor</code>). Enable only one minibuffer completion system and one in-buffer completion system.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc785660" class="outline-2">
<h2 id="orgc785660">Evil Mode &amp; Editing</h2>
<div class="outline-text-2" id="text-orgc785660">
</div>
<div id="outline-container-org165853e" class="outline-3">
<h3 id="org165853e">What is evil-mode?</h3>
<div class="outline-text-3" id="text-org165853e">
<p>
Evil is the Vim emulation layer. Doom enables it by default so you edit with modal
(normal/insert/visual) Vim keybindings.
</p>
</div>
</div>
<div id="outline-container-org2391d33" class="outline-3">
<h3 id="org2391d33">What are the Vim modes available?</h3>
<div class="outline-text-3" id="text-org2391d33">
<p>
Normal, Insert, Visual (char/line/block), Replace, Operator-pending, Motion, and Emacs state (<code>C-z</code> toggles Emacs state).
</p>
</div>
</div>
<div id="outline-container-orgfa36a30" class="outline-3">
<h3 id="orgfa36a30">How do I switch to Emacs (non-modal) state temporarily?</h3>
<div class="outline-text-3" id="text-orgfa36a30">
<p>
Press <code>C-z</code> to toggle <code>evil-emacs-state</code>, restoring native Emacs keybindings.
</p>
</div>
</div>
<div id="outline-container-org84977a7" class="outline-3">
<h3 id="org84977a7">How do I exit insert mode?</h3>
<div class="outline-text-3" id="text-org84977a7">
<p>
Press <code>ESC</code>, or <code>C-g</code>, or the configured <code>jk</code> escape sequence if enabled (<code>evil-escape</code>).
</p>
</div>
</div>
<div id="outline-container-org4aaf6bc" class="outline-3">
<h3 id="org4aaf6bc">What is <code>evil-escape</code>?</h3>
<div class="outline-text-3" id="text-org4aaf6bc">
<p>
A package letting you exit insert/visual mode by typing a quick two-key sequence
(default often <code>jk</code> or <code>fd</code>), avoiding reaching for <code>ESC</code>.
</p>
</div>
</div>
<div id="outline-container-orgc8c9376" class="outline-3">
<h3 id="orgc8c9376">How do I do a global search-and-replace in a file?</h3>
<div class="outline-text-3" id="text-orgc8c9376">
<p>
<code>:%s/old/new/g</code> (evil ex command), like in Vim. Add <code>c</code> for confirmation:
<code>:%s/old/new/gc</code>.
</p>
</div>
</div>
<div id="outline-container-org9e2da27" class="outline-3">
<h3 id="org9e2da27">How do I select and operate on text objects?</h3>
<div class="outline-text-3" id="text-org9e2da27">
<p>
Use Vim text objects: <code>ciw</code> (change inner word), <code>di"</code> (delete inside quotes),
<code>ya(</code> (yank around parens), etc. Doom adds extra objects via <code>evil-textobj-*</code>.
</p>
</div>
</div>
<div id="outline-container-org7865803" class="outline-3">
<h3 id="org7865803">What does <code>gd</code> do?</h3>
<div class="outline-text-3" id="text-org7865803">
<p>
<code>gd</code> jumps to definition (go-to-definition), wired to LSP/xref/tags depending on
the language.
</p>
</div>
</div>
<div id="outline-container-orgcf0e56f" class="outline-3">
<h3 id="orgcf0e56f">What does <code>gc</code> do?</h3>
<div class="outline-text-3" id="text-orgcf0e56f">
<p>
<code>gc</code> is the comment operator (from <code>evil-commentary</code> / <code>evil-nerd-commenter</code>): <code>gcc</code>
comments a line, <code>gc</code> + motion comments a region.
</p>
</div>
</div>
<div id="outline-container-orge404fe6" class="outline-3">
<h3 id="orge404fe6">How do I increment/decrement a number under the cursor?</h3>
<div class="outline-text-3" id="text-orge404fe6">
<p>
<code>C-a</code> increments, <code>C-x</code> decrements (evil-numbers / Doom binding). Note <code>C-x</code> is rebound from the Emacs prefix in normal state.
</p>
</div>
</div>
<div id="outline-container-org68aad7d" class="outline-3">
<h3 id="org68aad7d">How do I record and replay macros?</h3>
<div class="outline-text-3" id="text-org68aad7d">
<p>
<code>q</code> followed by a register (e.g. <code>qa</code>) records into register <code>a</code>; <code>q</code> stops; <code>@a</code> plays; <code>@@</code> repeats the last macro — standard Vim.
</p>
</div>
</div>
<div id="outline-container-org8f1a679" class="outline-3">
<h3 id="org8f1a679">How do I use marks and jumps?</h3>
<div class="outline-text-3" id="text-org8f1a679">
<p>
<code>m{a-z}</code> sets a mark, <code>'{a-z}</code> jumps to it; <code>C-o</code> / <code>C-i</code> move backward/forward in the jump list.
</p>
</div>
</div>
</div>
