org/posts/doom-emacs.org
* The Leader Key & Keybindings
** What is the leader key?
=SPC= (space) in normal/visual state is the Doom leader key, prefix for almost all
commands. In insert/Emacs state the leader is =M-SPC= or =C-c= depending on config.

** What is the localleader key?
=SPC m= (or =,= in normal state) is the localleader — mode-specific commands for the current major mode (e.g. org, python).

** How do I discover keybindings interactively?
Press =SPC= and wait: =which-key= shows a popup of available next keys. This is the primary discovery mechanism.

** What does =SPC f f= do?
Find file (=find-file=) — opens the file browser/minibuffer to open a file.

** What does =SPC .= do?
=find-file= starting at the current directory (quick file open).

** What does =SPC b b= do?
Switch buffer — lists open buffers to switch between.

** What does =SPC p p= do?
Switch project (Projectile) — lists known projects to open.

** What does =SPC :=  do?
=M-x= equivalent — execute an Emacs command by name (=execute-extended-command=).

** What does =SPC ;= do?
=eval-expression= — evaluate an Emacs Lisp expression in the minibuffer.

** What does =SPC h= prefix cover?
Help: =SPC h f= describe function, =SPC h v= describe variable, =SPC h k= describe key,
=SPC h d= Doom-specific help (docs, modules, news).

** How do I search for an action when I don't know the key?
=SPC :=  (M-x) and type a fuzzy command name, or =SPC h b b= to search all bindings.

** How do I define my own keybinding in config.el?
Use Doom's =map!= macro:

#+begin_src emacs-lisp
(map! :leader
      :desc "Format buffer" "c f" #'+format/buffer)
#+end_src

** How do I bind a key only in a specific mode?
#+begin_src emacs-lisp
(map! :map python-mode-map
      :n "gh" #'lsp-describe-thing-at-point)
#+end_src

=:n= scopes to normal state; =:map= scopes to a keymap.

** What do the state prefixes (:n :i :v :g) mean in map!?
=:n= normal, =:i= insert, =:v= visual, =:m= motion, =:e= emacs, =:g= global (all/no state), =:o= operator.
They scope the binding to evil states.

** How do I unbind a key?
Bind it to =nil=:

#+begin_src emacs-lisp
(map! :n "C-a" nil)
#+end_src

* Buffers, Windows & Workspaces
** What is the difference between a buffer, window, and frame?
A buffer holds content (a file or output); a window is a viewport showing a
buffer; a frame is an OS-level window containing windows.

** How do I split windows?
=SPC w v= vertical split, =SPC w s= horizontal split, =SPC w d= close window. Or evil: =C-w v=, =C-w s=, =C-w c=.

** How do I navigate between windows?
=SPC w h/j/k/l= or =C-w h/j/k/l= to move by direction; =SPC w w= to cycle.

** How do I kill a buffer?
=SPC b k= (=kill-buffer=) or =SPC b d=. =SPC b K= kills all other buffers.

** What are Doom workspaces?
Workspaces (via =persp-mode= / =:ui workspaces=) are named, isolated sets of buffers
and window layouts — like tabs/sessions. Switch with =SPC TAB=.

** How do I create and switch workspaces?
=SPC TAB n= new, =SPC TAB [= / =SPC TAB ]= previous/next, =SPC TAB 1..9= by number,
=SPC TAB .= switch by name.

** How are workspaces tied to projects?
Opening a project with =SPC p p= can spawn a new workspace, isolating its buffers from other projects.

** How do I save and restore sessions?
=SPC q s= save session, =SPC q l= restore last session. Workspaces persist layout and buffers.

** What does =SPC `= do?
Switch to the last (alternate) buffer — quick toggle between two buffers.

* Files, Projects & Search
** What is Projectile?
Projectile is project management: it detects project roots (=.git=, etc.) and gives
project-scoped commands for finding files, searching, and running commands.

** How do I find a file within the current project?
=SPC SPC= (=projectile-find-file=) or =SPC p f=.

** How do I search text across a project?
=SPC s p= (=+default/search-project=) runs ripgrep across the project. =SPC s b= searches the current buffer.

** What backs project search?
=ripgrep= (=rg=) for content search and =fd= for filename search; both must be installed and on PATH.

** What is =consult= / =consult-ripgrep=?
With Vertico-based completion, =consult= provides live, previewable search commands
like =consult-ripgrep= for incremental project-wide search.

** How do I open a recently used file?
=SPC f r= (recent files) lists files from history.

** How do I open dired (file manager)?
=SPC f d= or =SPC d= opens =dired= for the current directory; navigate with evil keys.

** What is the Doom dashboard?
The startup screen showing recent files, projects, and bookmarks. =SPC b H= or visiting =*doom*= returns to it.

