public/posts/doom-emacs.html
<div id="outline-container-org4958283" class="outline-2">
<h2 id="org4958283">The Leader Key &amp; Keybindings</h2>
<div class="outline-text-2" id="text-org4958283">
</div>
<div id="outline-container-org69dd5a4" class="outline-3">
<h3 id="org69dd5a4">What is the leader key?</h3>
<div class="outline-text-3" id="text-org69dd5a4">
<p>
<code>SPC</code> (space) in normal/visual state is the Doom leader key, prefix for almost all
commands. In insert/Emacs state the leader is <code>M-SPC</code> or <code>C-c</code> depending on config.
</p>
</div>
</div>
<div id="outline-container-orga45df10" class="outline-3">
<h3 id="orga45df10">What is the localleader key?</h3>
<div class="outline-text-3" id="text-orga45df10">
<p>
<code>SPC m</code> (or <code>,</code> in normal state) is the localleader — mode-specific commands for the current major mode (e.g. org, python).
</p>
</div>
</div>
<div id="outline-container-org3b76152" class="outline-3">
<h3 id="org3b76152">How do I discover keybindings interactively?</h3>
<div class="outline-text-3" id="text-org3b76152">
<p>
Press <code>SPC</code> and wait: <code>which-key</code> shows a popup of available next keys. This is the primary discovery mechanism.
</p>
</div>
</div>
<div id="outline-container-org6f2961e" class="outline-3">
<h3 id="org6f2961e">What does <code>SPC f f</code> do?</h3>
<div class="outline-text-3" id="text-org6f2961e">
<p>
Find file (<code>find-file</code>) — opens the file browser/minibuffer to open a file.
</p>
</div>
</div>
<div id="outline-container-org1f03748" class="outline-3">
<h3 id="org1f03748">What does <code>SPC .</code> do?</h3>
<div class="outline-text-3" id="text-org1f03748">
<p>
<code>find-file</code> starting at the current directory (quick file open).
</p>
</div>
</div>
<div id="outline-container-org8233a12" class="outline-3">
<h3 id="org8233a12">What does <code>SPC b b</code> do?</h3>
<div class="outline-text-3" id="text-org8233a12">
<p>
Switch buffer — lists open buffers to switch between.
</p>
</div>
</div>
<div id="outline-container-org540783a" class="outline-3">
<h3 id="org540783a">What does <code>SPC p p</code> do?</h3>
<div class="outline-text-3" id="text-org540783a">
<p>
Switch project (Projectile) — lists known projects to open.
</p>
</div>
</div>
<div id="outline-container-orgc93d9bd" class="outline-3">
<h3 id="orgc93d9bd">What does <code>SPC :</code>  do?</h3>
<div class="outline-text-3" id="text-orgc93d9bd">
<p>
<code>M-x</code> equivalent — execute an Emacs command by name (<code>execute-extended-command</code>).
</p>
</div>
</div>
<div id="outline-container-org0922598" class="outline-3">
<h3 id="org0922598">What does <code>SPC ;</code> do?</h3>
<div class="outline-text-3" id="text-org0922598">
<p>
<code>eval-expression</code> — evaluate an Emacs Lisp expression in the minibuffer.
</p>
</div>
</div>
<div id="outline-container-orgccb0a38" class="outline-3">
<h3 id="orgccb0a38">What does <code>SPC h</code> prefix cover?</h3>
<div class="outline-text-3" id="text-orgccb0a38">
<p>
Help: <code>SPC h f</code> describe function, <code>SPC h v</code> describe variable, <code>SPC h k</code> describe key,
<code>SPC h d</code> Doom-specific help (docs, modules, news).
</p>
</div>
</div>
<div id="outline-container-orgab86f81" class="outline-3">
<h3 id="orgab86f81">How do I search for an action when I don't know the key?</h3>
<div class="outline-text-3" id="text-orgab86f81">
<p>
<code>SPC :</code>  (M-x) and type a fuzzy command name, or <code>SPC h b b</code> to search all bindings.
</p>
</div>
</div>
<div id="outline-container-org0e9572f" class="outline-3">
<h3 id="org0e9572f">How do I define my own keybinding in config.el?</h3>
<div class="outline-text-3" id="text-org0e9572f">
<p>
Use Doom's <code>map!</code> macro:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(map! <span style="font-weight: bold;">:leader</span>
      <span style="font-weight: bold;">:desc</span> <span style="font-style: italic;">"Format buffer"</span> <span style="font-style: italic;">"c f"</span> #'+format/buffer)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8c7d2f" class="outline-3">
<h3 id="orgd8c7d2f">How do I bind a key only in a specific mode?</h3>
<div class="outline-text-3" id="text-orgd8c7d2f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(map! <span style="font-weight: bold;">:map</span> python-mode-map
      <span style="font-weight: bold;">:n</span> <span style="font-style: italic;">"gh"</span> #'lsp-describe-thing-at-point)
</pre>
</div>

<p>
<code>:n</code> scopes to normal state; <code>:map</code> scopes to a keymap.
</p>
</div>
</div>
<div id="outline-container-org8ac94b7" class="outline-3">
<h3 id="org8ac94b7">What do the state prefixes (:n :i :v :g) mean in map!?</h3>
<div class="outline-text-3" id="text-org8ac94b7">
<p>
<code>:n</code> normal, <code>:i</code> insert, <code>:v</code> visual, <code>:m</code> motion, <code>:e</code> emacs, <code>:g</code> global (all/no state), <code>:o</code> operator.
They scope the binding to evil states.
</p>
</div>
</div>
<div id="outline-container-org7dd1f8e" class="outline-3">
<h3 id="org7dd1f8e">How do I unbind a key?</h3>
<div class="outline-text-3" id="text-org7dd1f8e">
<p>
Bind it to <code>nil</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(map! <span style="font-weight: bold;">:n</span> <span style="font-style: italic;">"C-a"</span> nil)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6cc86f9" class="outline-2">
<h2 id="org6cc86f9">Buffers, Windows &amp; Workspaces</h2>
<div class="outline-text-2" id="text-org6cc86f9">
</div>
<div id="outline-container-org94a2d42" class="outline-3">
<h3 id="org94a2d42">What is the difference between a buffer, window, and frame?</h3>
<div class="outline-text-3" id="text-org94a2d42">
<p>
A buffer holds content (a file or output); a window is a viewport showing a
buffer; a frame is an OS-level window containing windows.
</p>
</div>
</div>
<div id="outline-container-org58128b5" class="outline-3">
<h3 id="org58128b5">How do I split windows?</h3>
<div class="outline-text-3" id="text-org58128b5">
<p>
<code>SPC w v</code> vertical split, <code>SPC w s</code> horizontal split, <code>SPC w d</code> close window. Or evil: <code>C-w v</code>, <code>C-w s</code>, <code>C-w c</code>.
</p>
</div>
</div>
<div id="outline-container-org955cbd0" class="outline-3">
<h3 id="org955cbd0">How do I navigate between windows?</h3>
<div class="outline-text-3" id="text-org955cbd0">
<p>
<code>SPC w h/j/k/l</code> or <code>C-w h/j/k/l</code> to move by direction; <code>SPC w w</code> to cycle.
</p>
</div>
</div>
<div id="outline-container-orgc3eaac3" class="outline-3">
<h3 id="orgc3eaac3">How do I kill a buffer?</h3>
<div class="outline-text-3" id="text-orgc3eaac3">
<p>
<code>SPC b k</code> (<code>kill-buffer</code>) or <code>SPC b d</code>. <code>SPC b K</code> kills all other buffers.
</p>
</div>
</div>
<div id="outline-container-org98ebd50" class="outline-3">
<h3 id="org98ebd50">What are Doom workspaces?</h3>
<div class="outline-text-3" id="text-org98ebd50">
<p>
Workspaces (via <code>persp-mode</code> / <code>:ui workspaces</code>) are named, isolated sets of buffers
and window layouts — like tabs/sessions. Switch with <code>SPC TAB</code>.
</p>
</div>
</div>
<div id="outline-container-org9911182" class="outline-3">
<h3 id="org9911182">How do I create and switch workspaces?</h3>
<div class="outline-text-3" id="text-org9911182">
<p>
<code>SPC TAB n</code> new, <code>SPC TAB [</code> / <code>SPC TAB ]</code> previous/next, <code>SPC TAB 1..9</code> by number,
<code>SPC TAB .</code> switch by name.
</p>
</div>
</div>
<div id="outline-container-orgdbd5950" class="outline-3">
<h3 id="orgdbd5950">How are workspaces tied to projects?</h3>
<div class="outline-text-3" id="text-orgdbd5950">
<p>
Opening a project with <code>SPC p p</code> can spawn a new workspace, isolating its buffers from other projects.
</p>
</div>
</div>
<div id="outline-container-org67c4c5a" class="outline-3">
<h3 id="org67c4c5a">How do I save and restore sessions?</h3>
<div class="outline-text-3" id="text-org67c4c5a">
<p>
<code>SPC q s</code> save session, <code>SPC q l</code> restore last session. Workspaces persist layout and buffers.
</p>
</div>
</div>
<div id="outline-container-org521936f" class="outline-3">
<h3 id="org521936f">What does <code>SPC `</code> do?</h3>
<div class="outline-text-3" id="text-org521936f">
<p>
Switch to the last (alternate) buffer — quick toggle between two buffers.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc60d04d" class="outline-2">
<h2 id="orgc60d04d">Files, Projects &amp; Search</h2>
<div class="outline-text-2" id="text-orgc60d04d">
</div>
<div id="outline-container-orgeab4032" class="outline-3">
<h3 id="orgeab4032">What is Projectile?</h3>
<div class="outline-text-3" id="text-orgeab4032">
<p>
Projectile is project management: it detects project roots (<code>.git</code>, etc.) and gives
project-scoped commands for finding files, searching, and running commands.
</p>
</div>
</div>
<div id="outline-container-org9d6fc41" class="outline-3">
<h3 id="org9d6fc41">How do I find a file within the current project?</h3>
<div class="outline-text-3" id="text-org9d6fc41">
<p>
<code>SPC SPC</code> (<code>projectile-find-file</code>) or <code>SPC p f</code>.
</p>
</div>
</div>
<div id="outline-container-orgde01b9b" class="outline-3">
<h3 id="orgde01b9b">How do I search text across a project?</h3>
<div class="outline-text-3" id="text-orgde01b9b">
<p>
<code>SPC s p</code> (<code>+default/search-project</code>) runs ripgrep across the project. <code>SPC s b</code> searches the current buffer.
</p>
</div>
</div>
<div id="outline-container-org0e79227" class="outline-3">
<h3 id="org0e79227">What backs project search?</h3>
<div class="outline-text-3" id="text-org0e79227">
<p>
<code>ripgrep</code> (<code>rg</code>) for content search and <code>fd</code> for filename search; both must be installed and on PATH.
</p>
</div>
</div>
<div id="outline-container-orgd183ede" class="outline-3">
<h3 id="orgd183ede">What is <code>consult</code> / <code>consult-ripgrep</code>?</h3>
<div class="outline-text-3" id="text-orgd183ede">
<p>
With Vertico-based completion, <code>consult</code> provides live, previewable search commands
like <code>consult-ripgrep</code> for incremental project-wide search.
</p>
</div>
</div>
<div id="outline-container-org8cb8665" class="outline-3">
<h3 id="org8cb8665">How do I open a recently used file?</h3>
<div class="outline-text-3" id="text-org8cb8665">
<p>
<code>SPC f r</code> (recent files) lists files from history.
</p>
</div>
</div>
<div id="outline-container-org6b6be69" class="outline-3">
<h3 id="org6b6be69">How do I open dired (file manager)?</h3>
<div class="outline-text-3" id="text-org6b6be69">
<p>
<code>SPC f d</code> or <code>SPC d</code> opens <code>dired</code> for the current directory; navigate with evil keys.
</p>
</div>
</div>
<div id="outline-container-org26953d0" class="outline-3">
<h3 id="org26953d0">What is the Doom dashboard?</h3>
<div class="outline-text-3" id="text-org26953d0">
<p>
The startup screen showing recent files, projects, and bookmarks. <code>SPC b H</code> or visiting <code>*doom*</code> returns to it.
</p>
</div>
</div>
