org/posts/doom-emacs.org
** How do I jump to a bookmark?
=SPC RET= (=bookmark-jump=); set with =SPC f b= or =bookmark-set=.

** How do I rename or delete the current file?
=SPC f R= rename/move, =SPC f D= delete current file.

** How do I copy the current file's path?
=SPC f y= copies the file path to the kill ring (yank).

* Completion (Minibuffer & In-buffer)
** What is Vertico?
A lightweight vertical minibuffer completion UI (the modern Doom default in the
=:completion vertico= module), replacing Ivy/Helm.

** What is Orderless?
A completion style allowing space-separated, order-independent fuzzy matching of candidates. It pairs with Vertico.

** What is Marginalia?
A package adding rich annotations (docs, file sizes, keybindings) beside minibuffer candidates.

** What is Embark?
=embark= provides context actions on the candidate at point (like a right-click menu) — act on files, buffers, symbols from the minibuffer. Often =SPC a= or =C-;=.

** What is the difference between company and corfu?
Both are in-buffer (at-point) completion popups. =company= is the older, mature
choice; =corfu= is the newer, lighter, =completion-at-point=-native alternative.

** How do I trigger in-buffer completion manually?
=C-SPC= or =TAB= (config dependent) invokes company/corfu; with LSP it shows symbol completions.

** How do I navigate completion candidates?
=C-n= / =C-p= (or arrow keys) move; =RET= or =TAB= accepts; =C-g= cancels.

** What is snippet completion (YASnippet)?
=yasnippet= expands abbreviations into templates with fields you tab through. Doom's
=:editor snippets= module enables it; =SPC i s= inserts a snippet.

** How do I add my own snippets?
=SPC i S= (or =yas-new-snippet=) and save into =~/.config/doom/snippets/<mode>/=.

* Org Mode
** What is Org mode?
A powerful Emacs major mode for notes, outlining, task management, agendas,
literate programming, and document authoring in plain text.

** How do I enable extra Org features in Doom?
Add flags in =init.el=: =(org +pretty +roam2 +journal +dragndrop)= etc., then =doom sync=.

** What is =org-directory= and how do I set it?
The base folder for org files/agenda. Set early in =config.el=:

#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

Set it before Org loads for agenda to pick it up.

** How do I create a TODO item?
Type a headline and prefix with =TODO=, or =SPC m t= to cycle TODO state on a headline. =S-LEFT/RIGHT= cycles keywords.

** How do I schedule or set a deadline?
=SPC m d s= schedule, =SPC m d d= deadline (or =org-schedule= / =org-deadline=). Adds a timestamp the agenda reads.

** How do I view the agenda?
=SPC o A= (or =org-agenda=) opens the agenda dispatcher; choose a view (day/week, TODO list).

** What is org-capture?
A quick note/task capture system. =SPC X= or =SPC n n= triggers a capture template to file notes into predefined locations.

** How do I define capture templates?
Set =org-capture-templates= in =config.el= via =after! org=:

#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-capture-templates
    '("t" "Todo" entry (file+headline "inbox.org" "Tasks")
      "* TODO %?\n  %U")))
#+end_src

** What are org babel source blocks?
=#+begin_src lang ... #+end_src= blocks you can execute in-buffer with =C-c C-c=,
enabling literate programming. Enable languages via =org-babel-load-languages=.

** What is org-roam?
A Zettelkasten-style note system (=+roam2= flag) for linked, networked notes with
backlinks. =SPC n r f= find/create a note, =SPC n r i= insert a link.

** What is org-export?
Exporting org documents to HTML, PDF (via LaTeX), Markdown, etc., via the export
dispatcher =SPC m e= (=org-export-dispatch=).

** How do I tangle code from an org file?
=org-babel-tangle= (=SPC m b t=) extracts source blocks into separate files — useful for literate config.

** How do I make org look prettier?
The =+pretty= flag enables =org-modern= / superstar bullets, prettified entities, and better headings.

* Git (Magit)
** What is Magit?
Magit is the premier Git porcelain for Emacs — a full-featured, fast Git interface
driven by single keystrokes. Enabled via =:tools magit=.

** How do I open Magit status?
=SPC g g= (=magit-status=) opens the status buffer for the current repo.

** How do I stage and unstage changes in Magit?
In the status buffer, move to a file/hunk and press =s= to stage, =u= to unstage.
=S= stages all.

** How do I commit in Magit?
Press =c c= to start a commit, write the message, then =C-c C-c= to finalize.

** How do I push and pull?
=P= opens the push transient, =F= the pull transient; choose remote/branch via the menu.

** How do I view a diff of a file's history?
=SPC g f l= file log, or in Magit =l l= for the log; press =RET= on a commit to view its diff.

