public/posts/doom-emacs.html
<div id="outline-container-orgc86b4c2" class="outline-3">
<h3 id="orgc86b4c2">How do I jump to a bookmark?</h3>
<div class="outline-text-3" id="text-orgc86b4c2">
<p>
<code>SPC RET</code> (<code>bookmark-jump</code>); set with <code>SPC f b</code> or <code>bookmark-set</code>.
</p>
</div>
</div>
<div id="outline-container-org6c4a704" class="outline-3">
<h3 id="org6c4a704">How do I rename or delete the current file?</h3>
<div class="outline-text-3" id="text-org6c4a704">
<p>
<code>SPC f R</code> rename/move, <code>SPC f D</code> delete current file.
</p>
</div>
</div>
<div id="outline-container-orga1dcf67" class="outline-3">
<h3 id="orga1dcf67">How do I copy the current file's path?</h3>
<div class="outline-text-3" id="text-orga1dcf67">
<p>
<code>SPC f y</code> copies the file path to the kill ring (yank).
</p>
</div>
</div>
</div>
<div id="outline-container-orgcb6ac07" class="outline-2">
<h2 id="orgcb6ac07">Completion (Minibuffer &amp; In-buffer)</h2>
<div class="outline-text-2" id="text-orgcb6ac07">
</div>
<div id="outline-container-org587fd8e" class="outline-3">
<h3 id="org587fd8e">What is Vertico?</h3>
<div class="outline-text-3" id="text-org587fd8e">
<p>
A lightweight vertical minibuffer completion UI (the modern Doom default in the
<code>:completion vertico</code> module), replacing Ivy/Helm.
</p>
</div>
</div>
<div id="outline-container-org54af19f" class="outline-3">
<h3 id="org54af19f">What is Orderless?</h3>
<div class="outline-text-3" id="text-org54af19f">
<p>
A completion style allowing space-separated, order-independent fuzzy matching of candidates. It pairs with Vertico.
</p>
</div>
</div>
<div id="outline-container-org8716557" class="outline-3">
<h3 id="org8716557">What is Marginalia?</h3>
<div class="outline-text-3" id="text-org8716557">
<p>
A package adding rich annotations (docs, file sizes, keybindings) beside minibuffer candidates.
</p>
</div>
</div>
<div id="outline-container-orgaf8d9f0" class="outline-3">
<h3 id="orgaf8d9f0">What is Embark?</h3>
<div class="outline-text-3" id="text-orgaf8d9f0">
<p>
<code>embark</code> provides context actions on the candidate at point (like a right-click menu) — act on files, buffers, symbols from the minibuffer. Often <code>SPC a</code> or <code>C-;</code>.
</p>
</div>
</div>
<div id="outline-container-org4c79dcd" class="outline-3">
<h3 id="org4c79dcd">What is the difference between company and corfu?</h3>
<div class="outline-text-3" id="text-org4c79dcd">
<p>
Both are in-buffer (at-point) completion popups. <code>company</code> is the older, mature
choice; <code>corfu</code> is the newer, lighter, <code>completion-at-point</code>-native alternative.
</p>
</div>
</div>
<div id="outline-container-org7d89925" class="outline-3">
<h3 id="org7d89925">How do I trigger in-buffer completion manually?</h3>
<div class="outline-text-3" id="text-org7d89925">
<p>
<code>C-SPC</code> or <code>TAB</code> (config dependent) invokes company/corfu; with LSP it shows symbol completions.
</p>
</div>
</div>
<div id="outline-container-org23bfb48" class="outline-3">
<h3 id="org23bfb48">How do I navigate completion candidates?</h3>
<div class="outline-text-3" id="text-org23bfb48">
<p>
<code>C-n</code> / <code>C-p</code> (or arrow keys) move; <code>RET</code> or <code>TAB</code> accepts; <code>C-g</code> cancels.
</p>
</div>
</div>
<div id="outline-container-org8cfe714" class="outline-3">
<h3 id="org8cfe714">What is snippet completion (YASnippet)?</h3>
<div class="outline-text-3" id="text-org8cfe714">
<p>
<code>yasnippet</code> expands abbreviations into templates with fields you tab through. Doom's
<code>:editor snippets</code> module enables it; <code>SPC i s</code> inserts a snippet.
</p>
</div>
</div>
<div id="outline-container-org8223266" class="outline-3">
<h3 id="org8223266">How do I add my own snippets?</h3>
<div class="outline-text-3" id="text-org8223266">
<p>
<code>SPC i S</code> (or <code>yas-new-snippet</code>) and save into <code>~/.config/doom/snippets/&lt;mode&gt;/</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbec555e" class="outline-2">
<h2 id="orgbec555e">Org Mode</h2>
<div class="outline-text-2" id="text-orgbec555e">
</div>
<div id="outline-container-orgccdf2fc" class="outline-3">
<h3 id="orgccdf2fc">What is Org mode?</h3>
<div class="outline-text-3" id="text-orgccdf2fc">
<p>
A powerful Emacs major mode for notes, outlining, task management, agendas,
literate programming, and document authoring in plain text.
</p>
</div>
</div>
<div id="outline-container-orgc5f7568" class="outline-3">
<h3 id="orgc5f7568">How do I enable extra Org features in Doom?</h3>
<div class="outline-text-3" id="text-orgc5f7568">
<p>
Add flags in <code>init.el</code>: <code>(org +pretty +roam2 +journal +dragndrop)</code> etc., then <code>doom sync</code>.
</p>
</div>
</div>
<div id="outline-container-org76a1029" class="outline-3">
<h3 id="org76a1029">What is <code>org-directory</code> and how do I set it?</h3>
<div class="outline-text-3" id="text-org76a1029">
<p>
The base folder for org files/agenda. Set early in <code>config.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-directory <span style="font-style: italic;">"~/org/"</span>)
</pre>
</div>

<p>
Set it before Org loads for agenda to pick it up.
</p>
</div>
</div>
<div id="outline-container-org93f45ff" class="outline-3">
<h3 id="org93f45ff">How do I create a TODO item?</h3>
<div class="outline-text-3" id="text-org93f45ff">
<p>
Type a headline and prefix with <code>TODO</code>, or <code>SPC m t</code> to cycle TODO state on a headline. <code>S-LEFT/RIGHT</code> cycles keywords.
</p>
</div>
</div>
<div id="outline-container-orga16fe2a" class="outline-3">
<h3 id="orga16fe2a">How do I schedule or set a deadline?</h3>
<div class="outline-text-3" id="text-orga16fe2a">
<p>
<code>SPC m d s</code> schedule, <code>SPC m d d</code> deadline (or <code>org-schedule</code> / <code>org-deadline</code>). Adds a timestamp the agenda reads.
</p>
</div>
</div>
<div id="outline-container-org40ff469" class="outline-3">
<h3 id="org40ff469">How do I view the agenda?</h3>
<div class="outline-text-3" id="text-org40ff469">
<p>
<code>SPC o A</code> (or <code>org-agenda</code>) opens the agenda dispatcher; choose a view (day/week, TODO list).
</p>
</div>
</div>
<div id="outline-container-orgf0d05ac" class="outline-3">
<h3 id="orgf0d05ac">What is org-capture?</h3>
<div class="outline-text-3" id="text-orgf0d05ac">
<p>
A quick note/task capture system. <code>SPC X</code> or <code>SPC n n</code> triggers a capture template to file notes into predefined locations.
</p>
</div>
</div>
<div id="outline-container-orgb0fbee1" class="outline-3">
<h3 id="orgb0fbee1">How do I define capture templates?</h3>
<div class="outline-text-3" id="text-orgb0fbee1">
<p>
Set <code>org-capture-templates</code> in <code>config.el</code> via <code>after! org</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(after! org
  (add-to-list 'org-capture-templates
    '(<span style="font-style: italic;">"t"</span> <span style="font-style: italic;">"Todo"</span> entry (file+headline <span style="font-style: italic;">"inbox.org"</span> <span style="font-style: italic;">"Tasks"</span>)
      <span style="font-style: italic;">"* TODO %?\n  %U"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge5932bf" class="outline-3">
<h3 id="orge5932bf">What are org babel source blocks?</h3>
<div class="outline-text-3" id="text-orge5932bf">
<p>
<code>#+begin_src lang ... #+end_src</code> blocks you can execute in-buffer with <code>C-c C-c</code>,
enabling literate programming. Enable languages via <code>org-babel-load-languages</code>.
</p>
</div>
</div>
<div id="outline-container-orgf36325e" class="outline-3">
<h3 id="orgf36325e">What is org-roam?</h3>
<div class="outline-text-3" id="text-orgf36325e">
<p>
A Zettelkasten-style note system (<code>+roam2</code> flag) for linked, networked notes with
backlinks. <code>SPC n r f</code> find/create a note, <code>SPC n r i</code> insert a link.
</p>
</div>
</div>
<div id="outline-container-org07e0e1a" class="outline-3">
<h3 id="org07e0e1a">What is org-export?</h3>
<div class="outline-text-3" id="text-org07e0e1a">
<p>
Exporting org documents to HTML, PDF (via LaTeX), Markdown, etc., via the export
dispatcher <code>SPC m e</code> (<code>org-export-dispatch</code>).
</p>
</div>
</div>
<div id="outline-container-orgeb682ef" class="outline-3">
<h3 id="orgeb682ef">How do I tangle code from an org file?</h3>
<div class="outline-text-3" id="text-orgeb682ef">
<p>
<code>org-babel-tangle</code> (<code>SPC m b t</code>) extracts source blocks into separate files — useful for literate config.
</p>
</div>
</div>
<div id="outline-container-org1961764" class="outline-3">
<h3 id="org1961764">How do I make org look prettier?</h3>
<div class="outline-text-3" id="text-org1961764">
<p>
The <code>+pretty</code> flag enables <code>org-modern</code> / superstar bullets, prettified entities, and better headings.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf9c4148" class="outline-2">
<h2 id="orgf9c4148">Git (Magit)</h2>
<div class="outline-text-2" id="text-orgf9c4148">
</div>
<div id="outline-container-orgaa03424" class="outline-3">
<h3 id="orgaa03424">What is Magit?</h3>
<div class="outline-text-3" id="text-orgaa03424">
<p>
Magit is the premier Git porcelain for Emacs — a full-featured, fast Git interface
driven by single keystrokes. Enabled via <code>:tools magit</code>.
</p>
</div>
</div>
<div id="outline-container-orgba882d1" class="outline-3">
<h3 id="orgba882d1">How do I open Magit status?</h3>
<div class="outline-text-3" id="text-orgba882d1">
<p>
<code>SPC g g</code> (<code>magit-status</code>) opens the status buffer for the current repo.
</p>
</div>
</div>
<div id="outline-container-org8067682" class="outline-3">
<h3 id="org8067682">How do I stage and unstage changes in Magit?</h3>
<div class="outline-text-3" id="text-org8067682">
<p>
In the status buffer, move to a file/hunk and press <code>s</code> to stage, <code>u</code> to unstage.
<code>S</code> stages all.
</p>
</div>
</div>
<div id="outline-container-orgef8f641" class="outline-3">
<h3 id="orgef8f641">How do I commit in Magit?</h3>
<div class="outline-text-3" id="text-orgef8f641">
<p>
Press <code>c c</code> to start a commit, write the message, then <code>C-c C-c</code> to finalize.
</p>
</div>
</div>
<div id="outline-container-org7ddde1d" class="outline-3">
<h3 id="org7ddde1d">How do I push and pull?</h3>
<div class="outline-text-3" id="text-org7ddde1d">
<p>
<code>P</code> opens the push transient, <code>F</code> the pull transient; choose remote/branch via the menu.
</p>
</div>
</div>
<div id="outline-container-org35e4393" class="outline-3">
<h3 id="org35e4393">How do I view a diff of a file's history?</h3>
<div class="outline-text-3" id="text-org35e4393">
<p>
<code>SPC g f l</code> file log, or in Magit <code>l l</code> for the log; press <code>RET</code> on a commit to view its diff.
</p>
</div>
</div>
