org/posts/doom-emacs.org
** What is a Magit transient?
The popup menu (Magit/Transient) listing available options and switches for an
action (push, log, rebase). You toggle flags then trigger.

** How do I do an interactive rebase?
=r i= in the log/status, select the base commit; reorder/squash/edit in the rebase
buffer, then =C-c C-c=.

** How do I resolve merge conflicts?
Use =smerge-mode= (auto-enabled) — keybindings under =SPC g= or =C-c ^= to keep
upper/lower/both; Magit shows conflicted files in status.

** What is git-gutter / diff-hl in Doom?
The =:ui vc-gutter= module shows added/changed/removed line indicators in the
fringe. =SPC g [= / =SPC g ]= jump between hunks.

** What is git-timemachine?
=SPC g t= steps through a file's historical revisions one commit at a time to see
how it changed.

** How do I blame a file?
=SPC g B= (=magit-blame=) annotates each line with its last-changing commit/author.

* Programming & LSP
** What is LSP and how does Doom use it?
LSP (Language Server Protocol) provides IDE features (completion, diagnostics,
go-to-def) via external servers. Doom integrates via the =:tools lsp= module
(=lsp-mode= or =eglot=).

** How do I enable LSP for a language?
Add the =+lsp= flag to the language module, e.g. =(python +lsp)=, enable =:tools lsp=,
install the language server, then =doom sync=.

** What is the difference between lsp-mode and eglot?
Both are LSP clients. =lsp-mode= is feature-rich and heavier; =eglot= (=+eglot= flag)
is minimal and built into Emacs 29+. Choose one in the =:tools lsp= module.

** How do I jump to a definition / find references?
=gd= go to definition, =gD= or =SPC c D= find references, =K= or =SPC c k= show docs at
point.

** How do I rename a symbol project-wide?
=SPC c r= (=lsp-rename= / =eglot-rename=) renames the symbol and updates references.

** How do I see and navigate errors/diagnostics?
=:checkers syntax= (Flycheck/Flymake) shows diagnostics; =SPC c x= lists errors,
=] e= / =[ e= jump to next/previous.

** What is Flycheck vs Flymake?
Both are on-the-fly syntax checkers. =flycheck= is the long-standing third-party
option; =flymake= is built-in and used by eglot. The =:checkers syntax= module
configures one.

** How do I format a buffer?
=SPC c f= (=+format/buffer=) via the =:editor format= module, using formatters like
=prettier=, =black=, =gofmt= per language.

** How do I run code or a REPL?
Many lang modules add a REPL under =SPC m r= or =SPC o r= (e.g. Python =SPC m r r=).
=:tools eval= enables =SPC c e= to eval regions.

** How do I comment code?
=gcc= a line, =gc= + motion a region (evil), or =SPC c c= region.

** How do I fold code?
=za= toggle fold, =zR= open all, =zM= close all (evil-vimish-fold / origami / built-in
=hideshow=). LSP can provide semantic folding.

** How do I add a language to Doom?
Enable its =:lang= module in =init.el= (e.g. =rust=, =go=, =java=), add flags like =+lsp=,
install toolchain + language server, =doom sync=, restart.

** What is Tree-sitter and does Doom use it?
Tree-sitter provides fast, accurate syntax parsing. Emacs 29+ has built-in
tree-sitter modes; Doom modules increasingly support =+tree-sitter= flags for better
highlighting and structural editing.

** How do I debug code in Doom?
The =:tools debugger= module enables =dap-mode= (with lsp) or =realgud=. =SPC c d=
starts a debug session; set breakpoints and step through.

* UI, Themes & Fonts
** How do I change the theme?
Set =doom-theme= in =config.el=:

#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

Browse themes live with =SPC h t= (=load-theme=).

** Where do themes come from?
The =doom-themes= package bundles many themes (=doom-one=, =doom-dracula=,
=doom-gruvbox=, etc.). You can also load any Emacs theme.

** How do I set the font?
Set =doom-font= (and optionally =doom-variable-pitch-font=, =doom-big-font=) in =config.el=:

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 14))
#+end_src

** Why don't icons show up?
You need a Nerd Font / icon font installed. Run =M-x nerd-icons-install-fonts= (or
=all-the-icons-install-fonts= on older Doom) and restart.

** What is the modeline and can I customize it?
The modeline (status bar) is =doom-modeline=. Configure via =after! doom-modeline= and
=setq doom-modeline-*= variables (e.g. height, icons, buffer name style).

** How do I enable line numbers?
=display-line-numbers-type= controls it:

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

=t= absolute, ='relative= relative, ='visual=, or =nil= off.

** How do I increase/decrease font size on the fly?
=SPC = += or =C-+= / =C--= adjust =text-scale=; =SPC t b= toggles =doom-big-font= (zen/present mode).

** What is zen / writeroom mode?
The =:ui zen= module centers text and removes distractions for writing. Toggle with
=SPC t z=.

