public/posts/doom-emacs.html
<div id="outline-container-orgf7bc899" class="outline-3">
<h3 id="orgf7bc899">What is a Magit transient?</h3>
<div class="outline-text-3" id="text-orgf7bc899">
<p>
The popup menu (Magit/Transient) listing available options and switches for an
action (push, log, rebase). You toggle flags then trigger.
</p>
</div>
</div>
<div id="outline-container-org23a1992" class="outline-3">
<h3 id="org23a1992">How do I do an interactive rebase?</h3>
<div class="outline-text-3" id="text-org23a1992">
<p>
<code>r i</code> in the log/status, select the base commit; reorder/squash/edit in the rebase
buffer, then <code>C-c C-c</code>.
</p>
</div>
</div>
<div id="outline-container-org1089686" class="outline-3">
<h3 id="org1089686">How do I resolve merge conflicts?</h3>
<div class="outline-text-3" id="text-org1089686">
<p>
Use <code>smerge-mode</code> (auto-enabled) — keybindings under <code>SPC g</code> or <code>C-c ^</code> to keep
upper/lower/both; Magit shows conflicted files in status.
</p>
</div>
</div>
<div id="outline-container-org526cae0" class="outline-3">
<h3 id="org526cae0">What is git-gutter / diff-hl in Doom?</h3>
<div class="outline-text-3" id="text-org526cae0">
<p>
The <code>:ui vc-gutter</code> module shows added/changed/removed line indicators in the
fringe. <code>SPC g [</code> / <code>SPC g ]</code> jump between hunks.
</p>
</div>
</div>
<div id="outline-container-orgd7dc5f9" class="outline-3">
<h3 id="orgd7dc5f9">What is git-timemachine?</h3>
<div class="outline-text-3" id="text-orgd7dc5f9">
<p>
<code>SPC g t</code> steps through a file's historical revisions one commit at a time to see
how it changed.
</p>
</div>
</div>
<div id="outline-container-orga83976d" class="outline-3">
<h3 id="orga83976d">How do I blame a file?</h3>
<div class="outline-text-3" id="text-orga83976d">
<p>
<code>SPC g B</code> (<code>magit-blame</code>) annotates each line with its last-changing commit/author.
</p>
</div>
</div>
</div>
<div id="outline-container-org922b114" class="outline-2">
<h2 id="org922b114">Programming &amp; LSP</h2>
<div class="outline-text-2" id="text-org922b114">
</div>
<div id="outline-container-orgf56e1b1" class="outline-3">
<h3 id="orgf56e1b1">What is LSP and how does Doom use it?</h3>
<div class="outline-text-3" id="text-orgf56e1b1">
<p>
LSP (Language Server Protocol) provides IDE features (completion, diagnostics,
go-to-def) via external servers. Doom integrates via the <code>:tools lsp</code> module
(<code>lsp-mode</code> or <code>eglot</code>).
</p>
</div>
</div>
<div id="outline-container-org05e5b88" class="outline-3">
<h3 id="org05e5b88">How do I enable LSP for a language?</h3>
<div class="outline-text-3" id="text-org05e5b88">
<p>
Add the <code>+lsp</code> flag to the language module, e.g. <code>(python +lsp)</code>, enable <code>:tools lsp</code>,
install the language server, then <code>doom sync</code>.
</p>
</div>
</div>
<div id="outline-container-org4655744" class="outline-3">
<h3 id="org4655744">What is the difference between lsp-mode and eglot?</h3>
<div class="outline-text-3" id="text-org4655744">
<p>
Both are LSP clients. <code>lsp-mode</code> is feature-rich and heavier; <code>eglot</code> (<code>+eglot</code> flag)
is minimal and built into Emacs 29+. Choose one in the <code>:tools lsp</code> module.
</p>
</div>
</div>
<div id="outline-container-org4d3bddb" class="outline-3">
<h3 id="org4d3bddb">How do I jump to a definition / find references?</h3>
<div class="outline-text-3" id="text-org4d3bddb">
<p>
<code>gd</code> go to definition, <code>gD</code> or <code>SPC c D</code> find references, <code>K</code> or <code>SPC c k</code> show docs at
point.
</p>
</div>
</div>
<div id="outline-container-org8d9e5f1" class="outline-3">
<h3 id="org8d9e5f1">How do I rename a symbol project-wide?</h3>
<div class="outline-text-3" id="text-org8d9e5f1">
<p>
<code>SPC c r</code> (<code>lsp-rename</code> / <code>eglot-rename</code>) renames the symbol and updates references.
</p>
</div>
</div>
<div id="outline-container-org32878cd" class="outline-3">
<h3 id="org32878cd">How do I see and navigate errors/diagnostics?</h3>
<div class="outline-text-3" id="text-org32878cd">
<p>
<code>:checkers syntax</code> (Flycheck/Flymake) shows diagnostics; <code>SPC c x</code> lists errors,
<code>] e</code> / <code>[ e</code> jump to next/previous.
</p>
</div>
</div>
<div id="outline-container-org5fe1495" class="outline-3">
<h3 id="org5fe1495">What is Flycheck vs Flymake?</h3>
<div class="outline-text-3" id="text-org5fe1495">
<p>
Both are on-the-fly syntax checkers. <code>flycheck</code> is the long-standing third-party
option; <code>flymake</code> is built-in and used by eglot. The <code>:checkers syntax</code> module
configures one.
</p>
</div>
</div>
<div id="outline-container-org5b4e9f7" class="outline-3">
<h3 id="org5b4e9f7">How do I format a buffer?</h3>
<div class="outline-text-3" id="text-org5b4e9f7">
<p>
<code>SPC c f</code> (<code>+format/buffer</code>) via the <code>:editor format</code> module, using formatters like
<code>prettier</code>, <code>black</code>, <code>gofmt</code> per language.
</p>
</div>
</div>
<div id="outline-container-orge5c29fb" class="outline-3">
<h3 id="orge5c29fb">How do I run code or a REPL?</h3>
<div class="outline-text-3" id="text-orge5c29fb">
<p>
Many lang modules add a REPL under <code>SPC m r</code> or <code>SPC o r</code> (e.g. Python <code>SPC m r r</code>).
<code>:tools eval</code> enables <code>SPC c e</code> to eval regions.
</p>
</div>
</div>
<div id="outline-container-orgce39d27" class="outline-3">
<h3 id="orgce39d27">How do I comment code?</h3>
<div class="outline-text-3" id="text-orgce39d27">
<p>
<code>gcc</code> a line, <code>gc</code> + motion a region (evil), or <code>SPC c c</code> region.
</p>
</div>
</div>
<div id="outline-container-orgecc9ae0" class="outline-3">
<h3 id="orgecc9ae0">How do I fold code?</h3>
<div class="outline-text-3" id="text-orgecc9ae0">
<p>
<code>za</code> toggle fold, <code>zR</code> open all, <code>zM</code> close all (evil-vimish-fold / origami / built-in
<code>hideshow</code>). LSP can provide semantic folding.
</p>
</div>
</div>
<div id="outline-container-orgf5d52f1" class="outline-3">
<h3 id="orgf5d52f1">How do I add a language to Doom?</h3>
<div class="outline-text-3" id="text-orgf5d52f1">
<p>
Enable its <code>:lang</code> module in <code>init.el</code> (e.g. <code>rust</code>, <code>go</code>, <code>java</code>), add flags like <code>+lsp</code>,
install toolchain + language server, <code>doom sync</code>, restart.
</p>
</div>
</div>
<div id="outline-container-org098ace0" class="outline-3">
<h3 id="org098ace0">What is Tree-sitter and does Doom use it?</h3>
<div class="outline-text-3" id="text-org098ace0">
<p>
Tree-sitter provides fast, accurate syntax parsing. Emacs 29+ has built-in
tree-sitter modes; Doom modules increasingly support <code>+tree-sitter</code> flags for better
highlighting and structural editing.
</p>
</div>
</div>
<div id="outline-container-orgbbad0fc" class="outline-3">
<h3 id="orgbbad0fc">How do I debug code in Doom?</h3>
<div class="outline-text-3" id="text-orgbbad0fc">
<p>
The <code>:tools debugger</code> module enables <code>dap-mode</code> (with lsp) or <code>realgud</code>. <code>SPC c d</code>
starts a debug session; set breakpoints and step through.
</p>
</div>
</div>
</div>
<div id="outline-container-orgef73dad" class="outline-2">
<h2 id="orgef73dad">UI, Themes &amp; Fonts</h2>
<div class="outline-text-2" id="text-orgef73dad">
</div>
<div id="outline-container-orga19cf00" class="outline-3">
<h3 id="orga19cf00">How do I change the theme?</h3>
<div class="outline-text-3" id="text-orga19cf00">
<p>
Set <code>doom-theme</code> in <code>config.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> doom-theme 'doom-one)
</pre>
</div>

<p>
Browse themes live with <code>SPC h t</code> (<code>load-theme</code>).
</p>
</div>
</div>
<div id="outline-container-orgb763d6f" class="outline-3">
<h3 id="orgb763d6f">Where do themes come from?</h3>
<div class="outline-text-3" id="text-orgb763d6f">
<p>
The <code>doom-themes</code> package bundles many themes (<code>doom-one</code>, <code>doom-dracula</code>,
<code>doom-gruvbox</code>, etc.). You can also load any Emacs theme.
</p>
</div>
</div>
<div id="outline-container-org35cd3ef" class="outline-3">
<h3 id="org35cd3ef">How do I set the font?</h3>
<div class="outline-text-3" id="text-org35cd3ef">
<p>
Set <code>doom-font</code> (and optionally <code>doom-variable-pitch-font</code>, <code>doom-big-font</code>) in <code>config.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> doom-font (font-spec <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"JetBrains Mono"</span> <span style="font-weight: bold;">:size</span> 14))
</pre>
</div>
</div>
</div>
<div id="outline-container-org996c73a" class="outline-3">
<h3 id="org996c73a">Why don't icons show up?</h3>
<div class="outline-text-3" id="text-org996c73a">
<p>
You need a Nerd Font / icon font installed. Run <code>M-x nerd-icons-install-fonts</code> (or
<code>all-the-icons-install-fonts</code> on older Doom) and restart.
</p>
</div>
</div>
<div id="outline-container-org4447bc0" class="outline-3">
<h3 id="org4447bc0">What is the modeline and can I customize it?</h3>
<div class="outline-text-3" id="text-org4447bc0">
<p>
The modeline (status bar) is <code>doom-modeline</code>. Configure via <code>after! doom-modeline</code> and
<code>setq doom-modeline-*</code> variables (e.g. height, icons, buffer name style).
</p>
</div>
</div>
<div id="outline-container-org13b9999" class="outline-3">
<h3 id="org13b9999">How do I enable line numbers?</h3>
<div class="outline-text-3" id="text-org13b9999">
<p>
<code>display-line-numbers-type</code> controls it:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> display-line-numbers-type 'relative)
</pre>
</div>

<p>
<code>t</code> absolute, <code>'relative</code> relative, <code>'visual</code>, or <code>nil</code> off.
</p>
</div>
</div>
<div id="outline-container-org41c60e5" class="outline-3">
<h3 id="org41c60e5">How do I increase/decrease font size on the fly?</h3>
<div class="outline-text-3" id="text-org41c60e5">
<p>
<code>SPC = +</code> or <code>C-+</code> / <code>C--</code> adjust <code>text-scale</code>; <code>SPC t b</code> toggles <code>doom-big-font</code> (zen/present mode).
</p>
</div>
</div>
<div id="outline-container-orgd3c55a0" class="outline-3">
<h3 id="orgd3c55a0">What is zen / writeroom mode?</h3>
<div class="outline-text-3" id="text-orgd3c55a0">
<p>
The <code>:ui zen</code> module centers text and removes distractions for writing. Toggle with
<code>SPC t z</code>.
</p>
</div>
</div>
