org/posts/doom-emacs.org
** How do I toggle a sidebar file tree?
The =:ui treemacs= module gives a project tree. =SPC o p= toggles =treemacs=; navigate
with evil keys.

** How do I change the splash/dashboard image?
Set =+doom-dashboard-banner-file= and =+doom-dashboard-banner-dir= in =config.el= to
point at a custom image.

* Terminals & External Tools
** What terminal options does Doom have?
=:term vterm= (fast, libvterm-based, recommended), =:term eshell= (elisp shell),
=:term shell= and =:term term=. =vterm= needs compilation of a native module.

** How do I open a terminal?
=SPC o t= opens a terminal in the current window; =SPC o T= in a popup. With vterm,
=SPC o t= or =M-x +vterm/here=.

** What is eshell?
An Emacs-implemented shell mixing shell syntax with Emacs Lisp; portable across
OSes and integrated with Emacs buffers. =SPC o e= opens it.

** How do I run an async shell command?
=M-x async-shell-command= or =SPC :=  then the command; output goes to a buffer
without blocking Emacs.

** How does Doom integrate with the system clipboard?
On GUI Emacs clipboard works out of the box; on terminal Emacs you may need
=xclip= / =wl-clipboard= (Linux) or =clipetty=. Evil yank/paste sync with the system
clipboard depending on config.

* Performance & Maintenance
** Why is my Emacs startup slow?
Run =doom doctor= and =M-x doom/profile-startup= (or =esup=). Common causes: unpinned
heavy packages, expensive =config.el= code not deferred, missing native compilation.

** How do I profile startup time?
=emacs --eval '(message "%s" (emacs-init-time))'= or use the =benchmark-init= /
=esup= package. Doom shows init time on the dashboard.

** What is lazy loading / deferring in Doom?
Doom defers package loading until needed. Use =after!= and =use-package!= with
=:defer= so your config doesn't load everything at startup.

** What is the =after!= macro?
Runs code only after a package/feature loads, avoiding eager loading:

#+begin_src emacs-lisp
(after! python
  (setq python-indent-offset 4))
#+end_src

** What is the =use-package!= macro?
Doom's wrapper over =use-package= for configuring packages with =:hook=, =:config=,
=:defer=, etc., in =config.el=.

** How do I keep Doom healthy over time?
Periodically run =doom upgrade=, =doom doctor=, =doom purge=, and =doom sync= after config
changes. Pin packages if you need stability.

** How do I clear Doom's caches?
=doom clean= / =doom purge= removes build artifacts and elc files; delete
=~/.config/emacs/.local/cache= for a deeper reset, then =doom sync=.

** Why did a package break after upgrade?
A package update introduced an incompatible change. Pin the working version in
=packages.el= with =(package! foo :pin "COMMITHASH")= and =doom sync=.

* Advanced Customization
** How do I install a package not in any module?
In =packages.el=:

#+begin_src emacs-lisp
(package! some-package)
#+end_src

Then =doom sync=, and configure it in =config.el= with =use-package!=.

** How do I install a package from a Git repo (recipe)?
#+begin_src emacs-lisp
(package! my-pkg
  :recipe (:host github :repo "user/repo" :files ("*.el")))
#+end_src

** How do I pin a package to a specific commit?
#+begin_src emacs-lisp
(package! magit :pin "abc1234...")
#+end_src

Pinning ensures reproducible builds across =doom upgrade=.

** How do I disable a package a module installs?
#+begin_src emacs-lisp
(package! the-package :disable t)
#+end_src

** How do I override a Doom module's behavior?
Use =after!= to re-set variables, =add-hook!=/=remove-hook!= to change hooks, or
=advice-add= to wrap functions. Avoid editing core module files directly.

** What is =add-hook!= (Doom's macro)?
A more ergonomic hook adder supporting multiple modes/functions:

#+begin_src emacs-lisp
(add-hook! 'python-mode-hook #'rainbow-mode)
#+end_src

** What is =setq-hook!=?
Sets buffer-local variables via a hook:

#+begin_src emacs-lisp
(setq-hook! 'python-mode-hook tab-width 4)
#+end_src

** How do I create a custom module?
Create =~/.config/doom/modules/<category>/<module>/= with =config.el=, =packages.el=,
=init.el=, add =(:category module)= to your =doom!= block, and =doom sync=.

** How do I define a custom interactive command?
#+begin_src emacs-lisp
(defun my/insert-date ()
  (interactive)
  (insert (format-time-string "%Y-%m-%d")))
(map! :leader :desc "Insert date" "i D" #'my/insert-date)
#+end_src

** How do I run code only on the first frame / for daemon?
Use =add-hook 'server-after-make-frame-hook= or Doom's
=after-init-hook=/=doom-after-init-hook= for daemon-safe setup (e.g. fonts, themes).

** How do I customize which-key delay and appearance?
#+begin_src emacs-lisp
(after! which-key
  (setq which-key-idle-delay 0.3))
#+end_src

