public/posts/doom-emacs.html
<div id="outline-container-org9ae5352" class="outline-3">
<h3 id="org9ae5352">How do I toggle a sidebar file tree?</h3>
<div class="outline-text-3" id="text-org9ae5352">
<p>
The <code>:ui treemacs</code> module gives a project tree. <code>SPC o p</code> toggles <code>treemacs</code>; navigate
with evil keys.
</p>
</div>
</div>
<div id="outline-container-orgca39f06" class="outline-3">
<h3 id="orgca39f06">How do I change the splash/dashboard image?</h3>
<div class="outline-text-3" id="text-orgca39f06">
<p>
Set <code>+doom-dashboard-banner-file</code> and <code>+doom-dashboard-banner-dir</code> in <code>config.el</code> to
point at a custom image.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbde7875" class="outline-2">
<h2 id="orgbde7875">Terminals &amp; External Tools</h2>
<div class="outline-text-2" id="text-orgbde7875">
</div>
<div id="outline-container-org1739df6" class="outline-3">
<h3 id="org1739df6">What terminal options does Doom have?</h3>
<div class="outline-text-3" id="text-org1739df6">
<p>
<code>:term vterm</code> (fast, libvterm-based, recommended), <code>:term eshell</code> (elisp shell),
<code>:term shell</code> and <code>:term term</code>. <code>vterm</code> needs compilation of a native module.
</p>
</div>
</div>
<div id="outline-container-org4f70c2e" class="outline-3">
<h3 id="org4f70c2e">How do I open a terminal?</h3>
<div class="outline-text-3" id="text-org4f70c2e">
<p>
<code>SPC o t</code> opens a terminal in the current window; <code>SPC o T</code> in a popup. With vterm,
<code>SPC o t</code> or <code>M-x +vterm/here</code>.
</p>
</div>
</div>
<div id="outline-container-orgde4be0d" class="outline-3">
<h3 id="orgde4be0d">What is eshell?</h3>
<div class="outline-text-3" id="text-orgde4be0d">
<p>
An Emacs-implemented shell mixing shell syntax with Emacs Lisp; portable across
OSes and integrated with Emacs buffers. <code>SPC o e</code> opens it.
</p>
</div>
</div>
<div id="outline-container-org02947f3" class="outline-3">
<h3 id="org02947f3">How do I run an async shell command?</h3>
<div class="outline-text-3" id="text-org02947f3">
<p>
<code>M-x async-shell-command</code> or <code>SPC :</code>  then the command; output goes to a buffer
without blocking Emacs.
</p>
</div>
</div>
<div id="outline-container-org401d3bf" class="outline-3">
<h3 id="org401d3bf">How does Doom integrate with the system clipboard?</h3>
<div class="outline-text-3" id="text-org401d3bf">
<p>
On GUI Emacs clipboard works out of the box; on terminal Emacs you may need
<code>xclip</code> / <code>wl-clipboard</code> (Linux) or <code>clipetty</code>. Evil yank/paste sync with the system
clipboard depending on config.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fac651" class="outline-2">
<h2 id="org6fac651">Performance &amp; Maintenance</h2>
<div class="outline-text-2" id="text-org6fac651">
</div>
<div id="outline-container-orgebd2ec6" class="outline-3">
<h3 id="orgebd2ec6">Why is my Emacs startup slow?</h3>
<div class="outline-text-3" id="text-orgebd2ec6">
<p>
Run <code>doom doctor</code> and <code>M-x doom/profile-startup</code> (or <code>esup</code>). Common causes: unpinned
heavy packages, expensive <code>config.el</code> code not deferred, missing native compilation.
</p>
</div>
</div>
<div id="outline-container-orgae2daa3" class="outline-3">
<h3 id="orgae2daa3">How do I profile startup time?</h3>
<div class="outline-text-3" id="text-orgae2daa3">
<p>
<code>emacs --eval '(message "%s" (emacs-init-time))'</code> or use the <code>benchmark-init</code> /
<code>esup</code> package. Doom shows init time on the dashboard.
</p>
</div>
</div>
<div id="outline-container-org593fdd4" class="outline-3">
<h3 id="org593fdd4">What is lazy loading / deferring in Doom?</h3>
<div class="outline-text-3" id="text-org593fdd4">
<p>
Doom defers package loading until needed. Use <code>after!</code> and <code>use-package!</code> with
<code>:defer</code> so your config doesn't load everything at startup.
</p>
</div>
</div>
<div id="outline-container-orgd08f727" class="outline-3">
<h3 id="orgd08f727">What is the <code>after!</code> macro?</h3>
<div class="outline-text-3" id="text-orgd08f727">
<p>
Runs code only after a package/feature loads, avoiding eager loading:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(after! python
  (<span style="font-weight: bold;">setq</span> python-indent-offset 4))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga80efc3" class="outline-3">
<h3 id="orga80efc3">What is the <code>use-package!</code> macro?</h3>
<div class="outline-text-3" id="text-orga80efc3">
<p>
Doom's wrapper over <code>use-package</code> for configuring packages with <code>:hook</code>, <code>:config</code>,
<code>:defer</code>, etc., in <code>config.el</code>.
</p>
</div>
</div>
<div id="outline-container-orgb5cdc02" class="outline-3">
<h3 id="orgb5cdc02">How do I keep Doom healthy over time?</h3>
<div class="outline-text-3" id="text-orgb5cdc02">
<p>
Periodically run <code>doom upgrade</code>, <code>doom doctor</code>, <code>doom purge</code>, and <code>doom sync</code> after config
changes. Pin packages if you need stability.
</p>
</div>
</div>
<div id="outline-container-org88d05de" class="outline-3">
<h3 id="org88d05de">How do I clear Doom's caches?</h3>
<div class="outline-text-3" id="text-org88d05de">
<p>
<code>doom clean</code> / <code>doom purge</code> removes build artifacts and elc files; delete
<code>~/.config/emacs/.local/cache</code> for a deeper reset, then <code>doom sync</code>.
</p>
</div>
</div>
<div id="outline-container-orga7433c2" class="outline-3">
<h3 id="orga7433c2">Why did a package break after upgrade?</h3>
<div class="outline-text-3" id="text-orga7433c2">
<p>
A package update introduced an incompatible change. Pin the working version in
<code>packages.el</code> with <code>(package! foo :pin "COMMITHASH")</code> and <code>doom sync</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org2a96745" class="outline-2">
<h2 id="org2a96745">Advanced Customization</h2>
<div class="outline-text-2" id="text-org2a96745">
</div>
<div id="outline-container-org7626a82" class="outline-3">
<h3 id="org7626a82">How do I install a package not in any module?</h3>
<div class="outline-text-3" id="text-org7626a82">
<p>
In <code>packages.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(package! some-package)
</pre>
</div>

<p>
Then <code>doom sync</code>, and configure it in <code>config.el</code> with <code>use-package!</code>.
</p>
</div>
</div>
<div id="outline-container-org735c13a" class="outline-3">
<h3 id="org735c13a">How do I install a package from a Git repo (recipe)?</h3>
<div class="outline-text-3" id="text-org735c13a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(package! my-pkg
  <span style="font-weight: bold;">:recipe</span> (<span style="font-weight: bold;">:host</span> github <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"user/repo"</span> <span style="font-weight: bold;">:files</span> (<span style="font-style: italic;">"*.el"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf394c8" class="outline-3">
<h3 id="orgcf394c8">How do I pin a package to a specific commit?</h3>
<div class="outline-text-3" id="text-orgcf394c8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(package! magit <span style="font-weight: bold;">:pin</span> <span style="font-style: italic;">"abc1234..."</span>)
</pre>
</div>

<p>
Pinning ensures reproducible builds across <code>doom upgrade</code>.
</p>
</div>
</div>
<div id="outline-container-orgf8b7c9f" class="outline-3">
<h3 id="orgf8b7c9f">How do I disable a package a module installs?</h3>
<div class="outline-text-3" id="text-orgf8b7c9f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(package! the-package <span style="font-weight: bold;">:disable</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5edd5d0" class="outline-3">
<h3 id="org5edd5d0">How do I override a Doom module's behavior?</h3>
<div class="outline-text-3" id="text-org5edd5d0">
<p>
Use <code>after!</code> to re-set variables, <code>add-hook!=/=remove-hook!</code> to change hooks, or
<code>advice-add</code> to wrap functions. Avoid editing core module files directly.
</p>
</div>
</div>
<div id="outline-container-org7d8adaa" class="outline-3">
<h3 id="org7d8adaa">What is <code>add-hook!</code> (Doom's macro)?</h3>
<div class="outline-text-3" id="text-org7d8adaa">
<p>
A more ergonomic hook adder supporting multiple modes/functions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook! 'python-mode-hook #'rainbow-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bb24b8" class="outline-3">
<h3 id="org8bb24b8">What is <code>setq-hook!</code>?</h3>
<div class="outline-text-3" id="text-org8bb24b8">
<p>
Sets buffer-local variables via a hook:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-hook! 'python-mode-hook tab-width 4)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf70d1f8" class="outline-3">
<h3 id="orgf70d1f8">How do I create a custom module?</h3>
<div class="outline-text-3" id="text-orgf70d1f8">
<p>
Create <code>~/.config/doom/modules/&lt;category&gt;/&lt;module&gt;/</code> with <code>config.el</code>, <code>packages.el</code>,
<code>init.el</code>, add <code>(:category module)</code> to your <code>doom!</code> block, and <code>doom sync</code>.
</p>
</div>
</div>
<div id="outline-container-orgdd65c41" class="outline-3">
<h3 id="orgdd65c41">How do I define a custom interactive command?</h3>
<div class="outline-text-3" id="text-orgdd65c41">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/insert-date</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (insert (format-time-string <span style="font-style: italic;">"%Y-%m-%d"</span>)))
(map! <span style="font-weight: bold;">:leader</span> <span style="font-weight: bold;">:desc</span> <span style="font-style: italic;">"Insert date"</span> <span style="font-style: italic;">"i D"</span> #'my/insert-date)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9f7928" class="outline-3">
<h3 id="orga9f7928">How do I run code only on the first frame / for daemon?</h3>
<div class="outline-text-3" id="text-orga9f7928">
<p>
Use <code>add-hook 'server-after-make-frame-hook</code> or Doom's
<code>after-init-hook=/=doom-after-init-hook</code> for daemon-safe setup (e.g. fonts, themes).
</p>
</div>
</div>
<div id="outline-container-org288d41e" class="outline-3">
<h3 id="org288d41e">How do I customize which-key delay and appearance?</h3>
<div class="outline-text-3" id="text-org288d41e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(after! which-key
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 0.3))
</pre>
</div>
</div>
</div>
