org/posts/doom-emacs.org
** How do I make a popup window behave differently?
Doom's =set-popup-rule!= controls popup placement/size:

#+begin_src emacs-lisp
(set-popup-rule! "^\\*compilation" :side 'bottom :size 0.3)
#+end_src
 
** How do I add a file template?
Doom uses =:editor file-templates=; add entries to =+file-templates-alist= or place
yasnippet templates so new files autopopulate.

** How do I conditionally load config per OS?
Use feature checks:

#+begin_src emacs-lisp
(when IS-WINDOWS (setq ...))
(when IS-MAC (setq mac-command-modifier 'meta))
#+end_src

Doom defines =IS-WINDOWS=, =IS-MAC=, =IS-LINUX=.

* Help, Discoverability & Learning
** How do I read documentation for a function?
=SPC h f= (=describe-function=), then its name; the help buffer links to source.

** How do I see what a key does?
=SPC h k= then press the key (=describe-key=) shows the bound command and docs.

** How do I see all keybindings active in a buffer?
=SPC h b b= searches bindings, or =M-x describe-bindings= lists them all.

** How do I access Doom's own documentation?
=SPC h d= prefix: =SPC h d d= docs index, =SPC h d m= module docs, =SPC h d n= Doom news,
=SPC h d h= help search.

** How do I report a Doom bug properly?
Run =doom doctor=, gather the output, and open an issue on the doomemacs GitHub with
your Emacs version, OS, and a minimal reproduction.
 
** What is the fastest way to learn evil/Vim motions?
Run =M-x evil-tutor= (if installed) or =vimtutor=; practice text objects and operators
daily. =SPC h= and which-key reinforce keybindings.

** Where can I find example Doom configs?
The doomemacs GitHub wiki, the official documentation, and many users publish their
=~/.doom.d= dotfiles on GitHub for reference.

* Troubleshooting
** Doom won't start after I edited config — what now?
Start Emacs with =emacs --debug-init= to see the backtrace, or temporarily move the
offending file. Fix the elisp error, then restart.

** A keybinding I set doesn't work — why?
Likely an evil-state or keymap mismatch. Check the state prefix in =map!= (=:n= vs
=:i=) and that the target keymap is loaded (wrap in =after!= if needed).

** Why does =doom sync= fail to download a package?
Network/proxy issues or a bad recipe. Check connectivity, the recipe spelling in
=packages.el=, and run =doom sync -u= or =doom doctor= for details.

** Icons/fonts look wrong in the terminal — why?
Terminal Emacs can't render GUI fonts/icons fully; use GUI Emacs or a terminal +
Nerd Font, and ensure =nerd-icons= fonts are installed.

** My LSP isn't activating — what should I check?
Confirm the language server is installed and on PATH, the =+lsp= flag is set,
=:tools lsp= is enabled, and check =M-x lsp-doctor= / =*lsp-log*= buffer.

** Changes to init.el aren't taking effect — why?
You must run =doom sync= after editing =init.el= or =packages.el=, then restart Emacs.
=config.el= changes only need a reload/restart.

** How do I fully reset Doom to a clean state?
Back up =~/.config/doom=, delete =~/.config/emacs/.local=, run =doom sync= (and possibly
=doom install=) to rebuild from scratch.

** Emacs is frozen — how do I recover?
=C-g= cancels the current command; =C-g C-g= more forcefully. If truly hung, the
daemon may need =emacsclient -e '(top-level)'= or a process kill as a last resort.

-----

#+INCLUDE: "../footer.org"
