public/posts/doom-emacs.html
<div id="outline-container-org27a049e" class="outline-3">
<h3 id="org27a049e">How do I make a popup window behave differently?</h3>
<div class="outline-text-3" id="text-org27a049e">
<p>
Doom's <code>set-popup-rule!</code> controls popup placement/size:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-popup-rule! <span style="font-style: italic;">"^\\*compilation"</span> <span style="font-weight: bold;">:side</span> 'bottom <span style="font-weight: bold;">:size</span> 0.3)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4058d38" class="outline-3">
<h3 id="org4058d38">How do I add a file template?</h3>
<div class="outline-text-3" id="text-org4058d38">
<p>
Doom uses <code>:editor file-templates</code>; add entries to <code>+file-templates-alist</code> or place
yasnippet templates so new files autopopulate.
</p>
</div>
</div>
<div id="outline-container-org7d4317b" class="outline-3">
<h3 id="org7d4317b">How do I conditionally load config per OS?</h3>
<div class="outline-text-3" id="text-org7d4317b">
<p>
Use feature checks:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">when</span> IS-WINDOWS (<span style="font-weight: bold;">setq</span> ...))
(<span style="font-weight: bold;">when</span> IS-MAC (<span style="font-weight: bold;">setq</span> mac-command-modifier 'meta))
</pre>
</div>

<p>
Doom defines <code>IS-WINDOWS</code>, <code>IS-MAC</code>, <code>IS-LINUX</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org0a7fdbb" class="outline-2">
<h2 id="org0a7fdbb">Help, Discoverability &amp; Learning</h2>
<div class="outline-text-2" id="text-org0a7fdbb">
</div>
<div id="outline-container-org294567c" class="outline-3">
<h3 id="org294567c">How do I read documentation for a function?</h3>
<div class="outline-text-3" id="text-org294567c">
<p>
<code>SPC h f</code> (<code>describe-function</code>), then its name; the help buffer links to source.
</p>
</div>
</div>
<div id="outline-container-orgc67cc24" class="outline-3">
<h3 id="orgc67cc24">How do I see what a key does?</h3>
<div class="outline-text-3" id="text-orgc67cc24">
<p>
<code>SPC h k</code> then press the key (<code>describe-key</code>) shows the bound command and docs.
</p>
</div>
</div>
<div id="outline-container-orgdc3beb1" class="outline-3">
<h3 id="orgdc3beb1">How do I see all keybindings active in a buffer?</h3>
<div class="outline-text-3" id="text-orgdc3beb1">
<p>
<code>SPC h b b</code> searches bindings, or <code>M-x describe-bindings</code> lists them all.
</p>
</div>
</div>
<div id="outline-container-org4d62957" class="outline-3">
<h3 id="org4d62957">How do I access Doom's own documentation?</h3>
<div class="outline-text-3" id="text-org4d62957">
<p>
<code>SPC h d</code> prefix: <code>SPC h d d</code> docs index, <code>SPC h d m</code> module docs, <code>SPC h d n</code> Doom news,
<code>SPC h d h</code> help search.
</p>
</div>
</div>
<div id="outline-container-org36b558e" class="outline-3">
<h3 id="org36b558e">How do I report a Doom bug properly?</h3>
<div class="outline-text-3" id="text-org36b558e">
<p>
Run <code>doom doctor</code>, gather the output, and open an issue on the doomemacs GitHub with
your Emacs version, OS, and a minimal reproduction.
</p>
</div>
</div>
<div id="outline-container-org91dbb92" class="outline-3">
<h3 id="org91dbb92">What is the fastest way to learn evil/Vim motions?</h3>
<div class="outline-text-3" id="text-org91dbb92">
<p>
Run <code>M-x evil-tutor</code> (if installed) or <code>vimtutor</code>; practice text objects and operators
daily. <code>SPC h</code> and which-key reinforce keybindings.
</p>
</div>
</div>
<div id="outline-container-orgb994160" class="outline-3">
<h3 id="orgb994160">Where can I find example Doom configs?</h3>
<div class="outline-text-3" id="text-orgb994160">
<p>
The doomemacs GitHub wiki, the official documentation, and many users publish their
<code>~/.doom.d</code> dotfiles on GitHub for reference.
</p>
</div>
</div>
</div>
<div id="outline-container-org07133ce" class="outline-2">
<h2 id="org07133ce">Troubleshooting</h2>
<div class="outline-text-2" id="text-org07133ce">
</div>
<div id="outline-container-org3604054" class="outline-3">
<h3 id="org3604054">Doom won't start after I edited config — what now?</h3>
<div class="outline-text-3" id="text-org3604054">
<p>
Start Emacs with <code>emacs --debug-init</code> to see the backtrace, or temporarily move the
offending file. Fix the elisp error, then restart.
</p>
</div>
</div>
<div id="outline-container-org6814bc1" class="outline-3">
<h3 id="org6814bc1">A keybinding I set doesn't work — why?</h3>
<div class="outline-text-3" id="text-org6814bc1">
<p>
Likely an evil-state or keymap mismatch. Check the state prefix in <code>map!</code> (<code>:n</code> vs
<code>:i</code>) and that the target keymap is loaded (wrap in <code>after!</code> if needed).
</p>
</div>
</div>
<div id="outline-container-orgf793c32" class="outline-3">
<h3 id="orgf793c32">Why does <code>doom sync</code> fail to download a package?</h3>
<div class="outline-text-3" id="text-orgf793c32">
<p>
Network/proxy issues or a bad recipe. Check connectivity, the recipe spelling in
<code>packages.el</code>, and run <code>doom sync -u</code> or <code>doom doctor</code> for details.
</p>
</div>
</div>
<div id="outline-container-org4db69c4" class="outline-3">
<h3 id="org4db69c4">Icons/fonts look wrong in the terminal — why?</h3>
<div class="outline-text-3" id="text-org4db69c4">
<p>
Terminal Emacs can't render GUI fonts/icons fully; use GUI Emacs or a terminal +
Nerd Font, and ensure <code>nerd-icons</code> fonts are installed.
</p>
</div>
</div>
<div id="outline-container-orgc111cb6" class="outline-3">
<h3 id="orgc111cb6">My LSP isn't activating — what should I check?</h3>
<div class="outline-text-3" id="text-orgc111cb6">
<p>
Confirm the language server is installed and on PATH, the <code>+lsp</code> flag is set,
<code>:tools lsp</code> is enabled, and check <code>M-x lsp-doctor</code> / <code>*lsp-log*</code> buffer.
</p>
</div>
</div>
<div id="outline-container-org7f92258" class="outline-3">
<h3 id="org7f92258">Changes to init.el aren't taking effect — why?</h3>
<div class="outline-text-3" id="text-org7f92258">
<p>
You must run <code>doom sync</code> after editing <code>init.el</code> or <code>packages.el</code>, then restart Emacs.
<code>config.el</code> changes only need a reload/restart.
</p>
</div>
</div>
<div id="outline-container-orgea63405" class="outline-3">
<h3 id="orgea63405">How do I fully reset Doom to a clean state?</h3>
<div class="outline-text-3" id="text-orgea63405">
<p>
Back up <code>~/.config/doom</code>, delete <code>~/.config/emacs/.local</code>, run <code>doom sync</code> (and possibly
<code>doom install</code>) to rebuild from scratch.
</p>
</div>
</div>
<div id="outline-container-org4314314" class="outline-3">
<h3 id="org4314314">Emacs is frozen — how do I recover?</h3>
<div class="outline-text-3" id="text-org4314314">
<p>
<code>C-g</code> cancels the current command; <code>C-g C-g</code> more forcefully. If truly hung, the
daemon may need <code>emacsclient -e '(top-level)'</code> or a process kill as a last resort.
</p>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
